
Функция ЗаполнитьПараметрыСтруктурШлюзов() Экспорт

	Результат = Новый Структура;
	
	Результат.Вставить( "ШлюзОрганизации", 			"" );
	Результат.Вставить( "Шлюз", 					"" );
	Результат.Вставить( "ДатаОтчета",				'00010101' );
	Результат.Вставить( "Пароль", 					"" );
	Результат.Вставить( "ВебАдрес", 				"" );
	Результат.Вставить( "ВидОбмена",				"" );
	Результат.Вставить( "ФлагУдаления",				"1" );
	Результат.Вставить( "ТекстОбмена",				"" );
	Результат.Вставить( "Ответ",					"" );
	Результат.Вставить( "КоличествоЗапросовКПеречитке",		0 );
	Возврат Результат;
	
КонецФункции

Функция УстановитьТипДанных( Тип, Размер = 12, Точность = 2 ) Экспорт
	Массив = Новый Массив;
	Массив.Добавить( Тип );
	
	Если Тип = Тип("Строка") Тогда
		Результат = Новый ОписаниеТипов( Массив, , Новый КвалификаторыСтроки( Размер ) );
	ИначеЕсли Тип = Тип("Число") Тогда 
		Результат = Новый ОписаниеТипов( Массив, Новый КвалификаторыЧисла( Размер, Точность ) );
	ИначеЕсли Тип = Тип("Дата") Тогда 
		Результат = Новый ОписаниеТипов( Массив, , , Новый КвалификаторыДаты( ЧастиДаты.ДатаВремя ) );  
	Иначе
		Результат = Новый ОписаниеТипов( Массив );
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСтруктуруРеквизитовДокумента(ШлюзОрганизации = "") Экспорт

	Результат = Новый Структура;
	
	Результат.Вставить( "ШлюзОрганизации", 			ШлюзОрганизации );
	Результат.Вставить( "Склад", 					Неопределено );
	Результат.Вставить( "РозничныйСклад",			Неопределено );
	Результат.Вставить( "Менеджер", 				Неопределено );
	Результат.Вставить( "Организация", 				Неопределено );
	Результат.Вставить( "Партнер", 					Неопределено );
	Результат.Вставить( "ГоловнойПартнер",			Неопределено );
	Результат.Вставить( "Контрагент", 				Неопределено );
	Результат.Вставить( "ГоловнойКонтрагент",		Неопределено );
	Результат.Вставить( "Договор", 					Неопределено );
	Результат.Вставить( "Соглашение",				Неопределено );
	Результат.Вставить( "Ф2",						Истина );
	Результат.Вставить( "Комментарий",				"" );
	Результат.Вставить( "НомерЗаказа",				"" );
	Результат.Вставить( "ДатаЗаказа",				'00010101' );
	Результат.Вставить( "ДатаОтгрузки",				'00010101' );
	Результат.Вставить( "МассивОшибок",				Новый Массив );
	Результат.Вставить( "НомерСтрокиДокумента",		0 );
	Результат.Вставить( "ЕстьКритическиеОшибки",	Ложь );
	Результат.Вставить( "СсылкаНаДокумент",			Неопределено );
	Возврат Результат;
	
КонецФункции

Функция ВернутьТекстЗапросаНаАктуальныеШлюзы() Экспорт
	
	ТекстЗапроса =	"ВЫБРАТЬ
       |	Mon_ШлюзыОрганизации.Наименование КАК Шлюз,
       |	Mon_ШлюзыОрганизации.Пароль КАК Пароль,
       |	Mon_ШлюзыОрганизации.ТипМонолита.ВебАдрес КАК ВебАдрес,
       |	Mon_ШлюзыОрганизации.Ссылка КАК ШлюзОрганизации
       |ИЗ
       |	Справочник.Mon_ШлюзыОрганизации КАК Mon_ШлюзыОрганизации
       |ГДЕ
       |	Mon_ШлюзыОрганизации.Активность";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВернутьТекстЗапросаНаПервыеАктуальныеШлюзыИзТиповОбмена() Экспорт
	
	ТекстЗапроса =	"ВЫБРАТЬ
	              	|	МАКСИМУМ(Mon_ШлюзыОрганизации.Ссылка) КАК ШлюзОрганизации,
	              	|	Mon_ШлюзыОрганизации.ТипМонолита КАК ТипМонолита
	              	|ПОМЕСТИТЬ ВТ_ВыборМаксимальных
	              	|ИЗ
	              	|	Справочник.Mon_ШлюзыОрганизации КАК Mon_ШлюзыОрганизации
	              	|ГДЕ
	              	|	Mon_ШлюзыОрганизации.Активность
	              	|
	              	|СГРУППИРОВАТЬ ПО
	              	|	Mon_ШлюзыОрганизации.ТипМонолита
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ
	              	|	Mon_ШлюзыОрганизации.Наименование КАК Шлюз,
	              	|	Mon_ШлюзыОрганизации.Пароль КАК Пароль,
	              	|	Mon_ШлюзыОрганизации.ТипМонолита.ВебАдрес КАК ВебАдрес,
	              	|	Mon_ШлюзыОрганизации.Ссылка КАК ШлюзОрганизации
	              	|ИЗ
	              	|	ВТ_ВыборМаксимальных КАК ВТ_ВыборМаксимальных
	              	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Mon_ШлюзыОрганизации КАК Mon_ШлюзыОрганизации
	              	|		ПО ВТ_ВыборМаксимальных.ШлюзОрганизации = Mon_ШлюзыОрганизации.Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВернутьТекстЗапросаНаПолучениеНоменклатуры() Экспорт
	
	ТекстЗапроса =	"ВЫБРАТЬ
	              	|	СоответствияНоменклатурыМонолит.Номенклатура КАК Номенклатура,
	              	|	СоответствияНоменклатурыМонолит.Упаковка КАК Упаковка,
					//|	СоответствияНоменклатурыМонолит.Коэффициент КАК Коэффициент
					|	ВЫБОР
					|		КОГДА СоответствияНоменклатурыМонолит.Коэффициент = 0.0333
					|			ТОГДА 1
					|		ИНАЧЕ СоответствияНоменклатурыМонолит.Коэффициент
					|	КОНЕЦ КАК Коэффициент
	              	|ИЗ
	              	|	РегистрСведений.Mon_СоответствияНоменклатуры КАК СоответствияНоменклатурыМонолит
	              	|ГДЕ
	              	|	СоответствияНоменклатурыМонолит.НоменклатураМонолит = &НоменклатураМонолит
	              	|	И СоответствияНоменклатурыМонолит.УпаковкаМонолит = &УпаковкаМонолит
	              	|	И СоответствияНоменклатурыМонолит.ТипМонолита = &ТипМонолита";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВернутьТекстЗапросаНаПолучениеПартнера() Экспорт
	
	ТекстЗапроса =	"ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Партнер,
		|	ДополнительныеСведения.Свойство КАК Свойство,
		|	ДополнительныеСведения.Объект.Родитель КАК ГоловнойПартнер,
		|	ДополнительныеСведения.Значение КАК Значение
		|	ИЗ
		|		РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|	ГДЕ
		|		ДополнительныеСведения.Объект Ссылка Справочник.Партнеры И
		|		ДополнительныеСведения.Свойство.Имя = ""КодМонолитБалтикаПартнеры""
		|		И ДополнительныеСведения.Значение = &КодТорговойТочки";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВернутьТекстЗапросаНаПолучениеКонтрагента() Экспорт
	
	ТекстЗапроса =	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Контрагенты.Ссылка КАК Контрагент,
			|	Контрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент
			|	ИЗ
			|		Справочник.Контрагенты КАК Контрагенты
			|	ГДЕ
			|		Контрагенты.Партнер = &Партнер";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВернутьТекстЗапросаНаПолучениеДоговора() Экспорт
	
	ТекстЗапроса =	"ВЫБРАТЬ
          |	ДоговорыКонтрагентов.Ссылка КАК Договор
          |ИЗ
          |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
          |ГДЕ
          |	ДоговорыКонтрагентов.Организация = &Организация
          |	И ДоговорыКонтрагентов.Менеджер = &Менеджер
          |	И ДоговорыКонтрагентов.Партнер = &Партнер
		  | И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
          |	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВернутьТекстЗапросаНаПолучениеСоглашения() Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
		|  СоглашенияСКлиентами.Ссылка КАК Соглашение
		|ИЗ
		|  Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
		|ГДЕ
		| СоглашенияСКлиентами.Партнер = &Партнер
		| И СоглашенияСКлиентами.Менеджер = &Менеджер
		| И СоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
        | И НЕ СоглашенияСКлиентами.ПометкаУдаления
		|
		|Объединить все
		|
		|ВЫБРАТЬ
		|  СоглашенияСКлиентами.Ссылка
		|ИЗ
		|  Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
		|ГДЕ
		|  СоглашенияСКлиентами.Партнер = &Партнер
		|  И СоглашенияСКлиентами.Менеджер = Значение(Справочник.Пользователи.ПустаяСсылка)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВернутьТекстЗапросаСтатусовДокументов() Экспорт

	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТЗ.ШлюзОрганизации КАК ШлюзОрганизации,
	               |	ТЗ.Шлюз КАК Шлюз,
	               |	ТЗ.ВидОбмена КАК ВидОбмена,
	               |	ТЗ.ФлагУдаления КАК ФлагУдаления
	               |ПОМЕСТИТЬ ВТ_ТЗ
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Mon_ШлюзыОрганизацииСклады.Ссылка КАК ШлюзОрганизации,
	               |	Mon_ШлюзыОрганизацииСклады.Ссылка.Пароль КАК Пароль,
	               |	Mon_ШлюзыОрганизацииСклады.Ссылка.Наименование КАК Шлюз,
	               |	Mon_ШлюзыОрганизацииСклады.КодСклада КАК КодСклада,
	               |	Mon_ШлюзыОрганизацииСклады.Склад КАК Склад,
	               |	ВТ_ТЗ.ВидОбмена КАК ВидОбмена
	               |ПОМЕСТИТЬ ВТ_Склады
	               |ИЗ
	               |	ВТ_ТЗ КАК ВТ_ТЗ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Mon_ШлюзыОрганизации.Склады КАК Mon_ШлюзыОрганизацииСклады
	               |		ПО ВТ_ТЗ.ШлюзОрганизации = Mon_ШлюзыОрганизацииСклады.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ Различные
	               |	ВТ_Склады.ШлюзОрганизации КАК ШлюзОрганизации,
	               |	ВТ_Склады.Шлюз КАК Шлюз,
				   |	&ДатаОтчета КАК ДатаОтчета,
				   |	ВТ_Склады.ВидОбмена КАК ВидОбмена,
	               |	ВТ_Склады.Пароль КАК Пароль,
	               |	ДокЗаказКлиента.НомерПоДаннымКлиента КАК КодДокумента,
	               |	ДокЗаказКлиента.ДатаПоДаннымКлиента КАК ДатаДокумента,
	               |	MIN(ВЫБОР
	               |		КОГДА ДокЗаказКлиента.ПометкаУдаления
	               |			ТОГДА ""Rejected""
	               |		КОГДА ДокЗаказКлиента.Проведен И НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL И РеализацияТоваровУслуг.Проведен
	               |			ТОГДА ""Dispatched""
	               |		КОГДА ДокЗаказКлиента.Проведен И НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL И РеализацияТоваровУслуг.ПометкаУдаления
	               |			ТОГДА ""Rejected""
				   |		КОГДА ДокЗаказКлиента.Проведен ТОГДА ""Transfered""
	               |	КОНЕЦ) КАК Статус
	               |ИЗ
	               |	Документ.ЗаказКлиента КАК ДокЗаказКлиента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК ВТ_Склады
	               |		ПО ДокЗаказКлиента.Склад = ВТ_Склады.Склад
				   |		Левое СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ДокЗаказКлиента.Ссылка = РеализацияТоваровУслуг.ЗаказКлиента
	               |ГДЕ ДокЗаказКлиента.НомерПоДаннымКлиента <> """" И 
	               |	ДокЗаказКлиента.Дата МЕЖДУ &ДатаОтчета И ДОБАВИТЬКДАТЕ(&ДатаОтчета, ДЕНЬ, 3)
	               |	 И (ДокЗаказКлиента.Проведен ИЛИ ДокЗаказКлиента.ПометкаУдаления)
				   |СГРУППИРОВАТЬ ПО
				   |ВТ_Склады.ШлюзОрганизации,
				   |ВТ_Склады.Шлюз,
				   |ДокЗаказКлиента.НомерПоДаннымКлиента,
				   |ДокЗаказКлиента.ДатаПоДаннымКлиента,
				   |ВТ_Склады.ВидОбмена,
				   |ВТ_Склады.Пароль
				   |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
				   |ВЫБРАТЬ Различные
				   |	ВТ_Склады.ШлюзОрганизации КАК ШлюзОрганизации,
	               |	ВТ_Склады.Шлюз КАК Шлюз,
				   |	&ДатаОтчета КАК ДатаОтчета,
				   |	ВТ_Склады.ВидОбмена КАК ВидОбмена,
	               |	ВТ_Склады.Пароль КАК Пароль,
	               |	ВозвратТоваровОтКлиента.НомерВходящегоДокумента КАК КодДокумента,
	               |	ВозвратТоваровОтКлиента.ДатаВходящегоДокумента КАК ДатаДокумента,
	               |	MIN(ВЫБОР
	               |		КОГДА ВозвратТоваровОтКлиента.ПометкаУдаления
	               |			ТОГДА ""Rejected""
	               |		КОГДА ВозвратТоваровОтКлиента.Проведен
	               |			ТОГДА ""Dispatched""
	               |	КОНЕЦ) КАК Статус
	               |ИЗ
	               |	Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК ВТ_Склады
	               |		ПО ВозвратТоваровОтКлиента.Склад = ВТ_Склады.Склад
	               |ГДЕ ВозвратТоваровОтКлиента.НомерВходящегоДокумента <> """" И
	               |	ВозвратТоваровОтКлиента.Дата МЕЖДУ &ДатаОтчета И ДОБАВИТЬКДАТЕ(&ДатаОтчета, ДЕНЬ, 3)
				   |	 И (ВозвратТоваровОтКлиента.Проведен ИЛИ ВозвратТоваровОтКлиента.ПометкаУдаления)
				   |СГРУППИРОВАТЬ ПО
				   |	ВТ_Склады.ШлюзОрганизации,
				   |	ВТ_Склады.Шлюз,
				   |	ВТ_Склады.ВидОбмена,
				   |	ВТ_Склады.Пароль,
				   |	ВозвратТоваровОтКлиента.НомерВходящегоДокумента,
				   |	ВозвратТоваровОтКлиента.ДатаВходящегоДокумента
				   |				   
				   |ОБЪЕДИНИТЬ ВСЕ
				   |
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	ВТ_Склады.ШлюзОрганизации,
				   |	ВТ_Склады.Шлюз,
				   |	&ДатаОтчета,
				   |	ВТ_Склады.ВидОбмена,
				   |	ВТ_Склады.Пароль,
				   |	ДополнительныеСведенияНомер.Значение,
				   |	ДополнительныеСведенияДата.Значение,
				   |	Min(ВЫБОР
				   |			КОГДА ПеремещениеТоваров.ПометкаУдаления
				   |				ТОГДА ""Rejected""
				   |			КОГДА ПеремещениеТоваров.Проведен
				   |				ТОГДА ""Dispatched""
				   |		КОНЕЦ)
				   |ИЗ
				   |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК ВТ_Склады
				   |		ПО (ПеремещениеТоваров.СкладПолучатель = ВТ_Склады.Склад)
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияДата
				   |		ПО (ДополнительныеСведенияДата.Объект = ПеремещениеТоваров.Ссылка 
				   |		И ДополнительныеСведенияДата.Свойство.Имя = ""ДатаЗаказаМонолитПеремещениеТоваров"")
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияНомер
				   |		ПО (ДополнительныеСведенияНомер.Объект = ПеремещениеТоваров.Ссылка
				   |		И ДополнительныеСведенияНомер.Значение <> """"  
				   |		И ДополнительныеСведенияНомер.Свойство.Имя = ""НомерЗаказаМонолитПеремещениеТоваров"")
				   |ГДЕ
				   |	ПеремещениеТоваров.Дата МЕЖДУ &ДатаОтчета И ДОБАВИТЬКДАТЕ(&ДатаОтчета, ДЕНЬ, 3)
				   |	И (ПеремещениеТоваров.Проведен
				   |			ИЛИ ПеремещениеТоваров.ПометкаУдаления)

				   |СГРУППИРОВАТЬ ПО
				   |	ВТ_Склады.ШлюзОрганизации,
				   |	ВТ_Склады.Шлюз,
				   |	ВТ_Склады.ВидОбмена,
				   |	ВТ_Склады.Пароль,
				   |	ДополнительныеСведенияНомер.Значение,
				   |	ДополнительныеСведенияДата.Значение			   
				   |ИТОГИ
	               |	МАКСИМУМ(Шлюз),
	               |	МАКСИМУМ(Пароль),
	               |	МАКСИМУМ(ДатаОтчета),
	               |	МАКСИМУМ(ВидОбмена)
	               |ПО
	               |	ШлюзОрганизации";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВернутьТекстЗапросаГрафикаДоставки() Экспорт

	ТекстЗапроса = "ВЫБРАТЬ
       |	ТЗ.ШлюзОрганизации КАК ШлюзОрганизации,
       |	ТЗ.Шлюз КАК Шлюз,
       |	ТЗ.ВидОбмена КАК ВидОбмена,
       |	ТЗ.ФлагУдаления КАК ФлагУдаления
       |ПОМЕСТИТЬ ВТ_ТЗ
       |ИЗ
       |	&ТЗ КАК ТЗ
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |ВЫБРАТЬ
       |	Mon_ШлюзыОрганизацииТорговыеПредставители.Ссылка КАК ШлюзОрганизации,
       |	Mon_ШлюзыОрганизацииТорговыеПредставители.Ссылка.Пароль КАК Пароль,
       |	Mon_ШлюзыОрганизацииТорговыеПредставители.Ссылка.Наименование КАК Шлюз,
	   |	Mon_ШлюзыОрганизацииТорговыеПредставители.Ссылка.Организация КАК Организация,
	   |	Mon_ШлюзыОрганизацииТорговыеПредставители.Ссылка.ОрганизацияФ2 КАК ОрганизацияФ2,
       |	Mon_ШлюзыОрганизацииТорговыеПредставители.КодТорговогоПредставителя КАК КодТорговогоПредставителя,
       |	Mon_ШлюзыОрганизацииТорговыеПредставители.ТорговыйПредставитель КАК ТорговыйПредставитель,
       |	ВТ_ТЗ.ВидОбмена КАК ВидОбмена,
       |	ВТ_ТЗ.ФлагУдаления КАК ФлагУдаления
       |ПОМЕСТИТЬ ВТ_ТорговыеПредставители
       |ИЗ
       |	ВТ_ТЗ КАК ВТ_ТЗ
       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Mon_ШлюзыОрганизации.ТорговыеПредставители КАК Mon_ШлюзыОрганизацииТорговыеПредставители
       |		ПО ВТ_ТЗ.ШлюзОрганизации = Mon_ШлюзыОрганизацииТорговыеПредставители.Ссылка
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |ВЫБРАТЬ
       |	ДополнительныеСведения.Объект КАК Партнер,
       |	ДополнительныеСведения.Значение КАК КодТорговойТочки
       |ПОМЕСТИТЬ ВТ_СоответствияТорговыхТочек
       |ИЗ
       |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
       |ГДЕ
       |	ДополнительныеСведения.Объект ССЫЛКА Справочник.Партнеры
       |	И ДополнительныеСведения.Свойство.Имя = ""КодМонолитБалтикаПартнеры""
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |ВЫБРАТЬ РАЗЛИЧНЫЕ
	   |	ВТ_ТорговыеПредставители.ШлюзОрганизации КАК ШлюзОрганизации,
	   |	ВТ_ТорговыеПредставители.Шлюз КАК Шлюз,
       |	ВТ_ТорговыеПредставители.ВидОбмена КАК ВидОбмена,
       |	ВТ_ТорговыеПредставители.Пароль КАК Пароль,
       |	ВТ_ТорговыеПредставители.ФлагУдаления КАК ФлагУдаления,
	   |	&ДатаОтчетаСтрокой КАК ДатаОтчетаСтрокой,
	   |	&ДатаОтчета КАК ДатаОтчета,
       |	ДоговорыКонтрагентов.Партнер.Код КАК ПартнерКод,
       |	ДоговорыКонтрагентов.Контрагент.ИНН КАК КонтрагентИНН,
       |	ВТ_СоответствияТорговыхТочек.КодТорговойТочки КАК КодТорговойТочки
       |ИЗ
       |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТорговыеПредставители КАК ВТ_ТорговыеПредставители
       |		ПО (ДоговорыКонтрагентов.Организация = ВТ_ТорговыеПредставители.Организация
       |				ИЛИ ДоговорыКонтрагентов.Организация = ВТ_ТорговыеПредставители.ОрганизацияФ2)
       |			И (ВТ_ТорговыеПредставители.ТорговыйПредставитель = ДоговорыКонтрагентов.Менеджер)
       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоответствияТорговыхТочек КАК ВТ_СоответствияТорговыхТочек
       |		ПО (ДоговорыКонтрагентов.Партнер = ВТ_СоответствияТорговыхТочек.Партнер)
       |ГДЕ
       |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
       |ИТОГИ
       |	МАКСИМУМ(Шлюз),
       |	МАКСИМУМ(Пароль),
       |	МАКСИМУМ(ДатаОтчета),
	   |	МАКСИМУМ(ДатаОтчетаСтрокой),
       |	МАКСИМУМ(ВидОбмена)
       |ПО
       |	ШлюзОрганизации";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВернутьТекстЗапросаСпискаБлокированныхКлиентов() Экспорт

	
	ТекстЗапроса = "ВЫБРАТЬ
        |	ТЗ.ШлюзОрганизации КАК ШлюзОрганизации,
        |	ТЗ.Шлюз КАК Шлюз,
        |	ТЗ.ВидОбмена КАК ВидОбмена,
        |	ТЗ.ФлагУдаления КАК ФлагУдаления
        |ПОМЕСТИТЬ ВТ_ТЗ
        |ИЗ
        |	&ТЗ КАК ТЗ
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	Mon_ШлюзыОрганизацииТорговыеПредставители.Ссылка КАК ШлюзОрганизации,
        |	Mon_ШлюзыОрганизацииТорговыеПредставители.Ссылка.Пароль КАК Пароль,
        |	Mon_ШлюзыОрганизацииТорговыеПредставители.Ссылка.Наименование КАК Шлюз,
	    |	Mon_ШлюзыОрганизацииТорговыеПредставители.Ссылка.Организация КАК Организация,
	    |	Mon_ШлюзыОрганизацииТорговыеПредставители.Ссылка.ОрганизацияФ2 КАК ОрганизацияФ2,
        |	Mon_ШлюзыОрганизацииТорговыеПредставители.КодТорговогоПредставителя КАК КодТорговогоПредставителя,
        |	Mon_ШлюзыОрганизацииТорговыеПредставители.ТорговыйПредставитель КАК ТорговыйПредставитель,
        |	ВТ_ТЗ.ВидОбмена КАК ВидОбмена,
        |	ВТ_ТЗ.ФлагУдаления КАК ФлагУдаления
        |ПОМЕСТИТЬ ВТ_ТорговыеПредставители
        |ИЗ
        |	ВТ_ТЗ КАК ВТ_ТЗ
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Mon_ШлюзыОрганизации.ТорговыеПредставители КАК Mon_ШлюзыОрганизацииТорговыеПредставители
        |		ПО ВТ_ТЗ.ШлюзОрганизации = Mon_ШлюзыОрганизацииТорговыеПредставители.Ссылка
        |;
        |
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Партнер,
		|	ДополнительныеСведения.Значение КАК КодТорговойТочки
		|ПОМЕСТИТЬ ВТ_СоответствияТорговыхТочек
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Справочник.Партнеры
		|	И ДополнительныеСведения.Свойство.Имя = ""КодМонолитБалтикаПартнеры""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ТорговыеПредставители.ШлюзОрганизации КАК ШлюзОрганизации,
		|	ВТ_ТорговыеПредставители.Шлюз КАК Шлюз,
		|	ВТ_ТорговыеПредставители.ВидОбмена КАК ВидОбмена,
		|	ВТ_ТорговыеПредставители.Пароль КАК Пароль,
		|	ВТ_ТорговыеПредставители.ФлагУдаления КАК ФлагУдаления,
		|	&ДатаОтчетаСтрокой КАК ДатаОтчетаСтрокой,
		|	&ДатаОтчета КАК ДатаОтчета,
		|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Контрагент.ИНН КАК КонтрагентИНН,
		|	РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Партнер.Код КАК ПартнерКод,
		|   ВТ_СоответствияТорговыхТочек.КодТорговойТочки КАК КодТорговойТочки
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&ДатаОтчета, ДатаПлановогоПогашения < &ДатаОтчета) КАК РасчетыСКлиентамиПоСрокам	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТорговыеПредставители КАК ВТ_ТорговыеПредставители
		|       		ПО (РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.Организация = ВТ_ТорговыеПредставители.Организация
		|       				ИЛИ РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.Организация = ВТ_ТорговыеПредставители.ОрганизацияФ2)
		|       			И (РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Договор.Менеджер = ВТ_ТорговыеПредставители.ТорговыйПредставитель)	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоответствияТорговыхТочек КАК ВТ_СоответствияТорговыхТочек
		|       ПО (РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам.Партнер = ВТ_СоответствияТорговыхТочек.Партнер)
		|ГДЕ
		|	РасчетыСКлиентамиПоСрокам.ДолгОстаток > 0
		|
		|ИТОГИ
		| 	МАКСИМУМ(Шлюз),
		|  	МАКСИМУМ(Пароль),
		|  	МАКСИМУМ(ДатаОтчета),
		| 	МАКСИМУМ(ДатаОтчетаСтрокой),
		|  	МАКСИМУМ(ВидОбмена)
		|ПО
		|  	ШлюзОрганизации
		|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВернутьТекстЗапросаПричинНедопоставки() Экспорт

	ТекстЗапроса = "
	    |ВЫБРАТЬ
		|	ТЗ.ШлюзОрганизации КАК ШлюзОрганизации,
		|	ТЗ.Шлюз КАК Шлюз,
		|	ТЗ.ВидОбмена КАК ВидОбмена,
		|	ТЗ.ФлагУдаления КАК ФлагУдаления
		|ПОМЕСТИТЬ ВТ_ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Mon_ШлюзыОрганизацииСклады.Ссылка КАК ШлюзОрганизации,
		|	Mon_ШлюзыОрганизацииСклады.Ссылка.Пароль КАК Пароль,
		|	Mon_ШлюзыОрганизацииСклады.Ссылка.Наименование КАК Шлюз,
		|	Mon_ШлюзыОрганизацииСклады.КодСклада КАК КодСклада,
		|	Mon_ШлюзыОрганизацииСклады.Склад КАК Склад,
		|	ВТ_ТЗ.ВидОбмена КАК ВидОбмена,
		|	ВТ_ТЗ.ФлагУдаления КАК ФлагУдаления
		|ПОМЕСТИТЬ ВТ_Склады
		|ИЗ
		|	ВТ_ТЗ КАК ВТ_ТЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Mon_ШлюзыОрганизации.Склады КАК Mon_ШлюзыОрганизацииСклады
		|		ПО ВТ_ТЗ.ШлюзОрганизации = Mon_ШлюзыОрганизацииСклады.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК ЗаказКлиента,
		|	ДополнительныеСведения.Значение.ПолноеНаименование КАК Значение
		|ПОМЕСТИТЬ ВТ_ПричинаНедопоставкиЗаказКлиента
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Документ.ЗаказКлиента
		|	И ДополнительныеСведения.Свойство.Имя = ""ПричинаНедопоставкиЗаказКлиента""
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_Склады.ШлюзОрганизации) КАК ШлюзОрганизации,
		|	МАКСИМУМ(ВТ_Склады.Шлюз) КАК Шлюз,
		|	МАКСИМУМ(&ДатаОтчета) КАК ДатаОтчета,
		|	МАКСИМУМ(ВТ_Склады.ВидОбмена) КАК ВидОбмена,
		|	МАКСИМУМ(ВТ_Склады.Пароль) КАК Пароль,
		|	МАКСИМУМ(ВТ_Склады.ФлагУдаления) КАК ФлагУдаления,
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
		|	ЗаказКлиентаТовары.Ссылка.НомерПоДаннымКлиента КАК НомерПоДаннымКлиента,
		|	ЗаказКлиентаТовары.Ссылка.ДатаПоДаннымКлиента КАК ДатаПоДаннымКлиента,
		|	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество,
		|	ЗаказКлиентаТовары.Ссылка.ДатаОтгрузки КАК ДатаОтгрузки
		|ПОМЕСТИТЬ ВТ_ЗаказыСгруппированные
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК ВТ_Склады
		|		ПО ЗаказКлиентаТовары.Ссылка.Склад = ВТ_Склады.Склад
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка.НомерПоДаннымКлиента <> """"
		|	И ЗаказКлиентаТовары.Ссылка.ДатаПоДаннымКлиента <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ЗаказКлиентаТовары.Ссылка.ДатаОтгрузки = НАЧАЛОПЕРИОДА(&ДатаОтчета, ДЕНЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Номенклатура.Артикул,
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения,
		|	ЗаказКлиентаТовары.Ссылка,
		|	ЗаказКлиентаТовары.Ссылка.НомерПоДаннымКлиента,
		|	ЗаказКлиентаТовары.Ссылка.ДатаПоДаннымКлиента,
		|	ЗаказКлиентаТовары.Ссылка.ДатаОтгрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
		|	НАЧАЛОПЕРИОДА(РеализацияТоваровУслугТовары.Ссылка.Дата, ДЕНЬ) КАК Дата
		|ПОМЕСТИТЬ ВТ_РеализацииСгруппированные
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ВТ_ЗаказыСгруппированные.Ссылка КАК Ссылка
		|		ИЗ
		|			ВТ_ЗаказыСгруппированные КАК ВТ_ЗаказыСгруппированные) КАК ВложенныйЗапрос
		|		ПО РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента = ВложенныйЗапрос.Ссылка
		|			И (РеализацияТоваровУслугТовары.Ссылка.Проведен)
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	НАЧАЛОПЕРИОДА(РеализацияТоваровУслугТовары.Ссылка.Дата, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|   ВТ_РеализацииСгруппированные.ЗаказКлиента КАК ЗаказКлиента,
		|	ВТ_РеализацииСгруппированные.Ссылка КАК Ссылка,
		|	НАЧАЛОПЕРИОДА(ВТ_РеализацииСгруппированные.Ссылка.Дата, ДЕНЬ) КАК Дата
		|ПОМЕСТИТЬ ВТ_РеализацииСвернутые
		|ИЗ
		|	ВТ_РеализацииСгруппированные КАК ВТ_РеализацииСгруппированные
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказыСгруппированные.ШлюзОрганизации КАК ШлюзОрганизации,
		|	ВТ_ЗаказыСгруппированные.Шлюз КАК Шлюз,
		|	ВТ_ЗаказыСгруппированные.ВидОбмена КАК ВидОбмена,
		|	ВТ_ЗаказыСгруппированные.Пароль КАК Пароль,
		|	ВТ_ЗаказыСгруппированные.ФлагУдаления КАК ФлагУдаления,
		|	ВТ_ЗаказыСгруппированные.Ссылка КАК ЗаказКлиента,
		|	ВТ_ЗаказыСгруппированные.НомерПоДаннымКлиента КАК НомерПоДаннымКлиента,
		|	ВТ_ЗаказыСгруппированные.ДатаПоДаннымКлиента КАК ДатаПоДаннымКлиента,
		|	ВТ_ЗаказыСгруппированные.Номенклатура КАК Номенклатура,
		|	ВТ_ЗаказыСгруппированные.НоменклатураАртикул КАК НоменклатураАртикул,
		|	ВТ_ЗаказыСгруппированные.Количество КАК Количество,
		|	ВТ_ЗаказыСгруппированные.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ЕСТЬNULL(ВТ_РеализацииСгруппированные.Количество, 0) КАК КоличествоРеализации,
		|	ЕСТЬNULL(ВТ_РеализацииСгруппированные.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК Дата,
		|	ВТ_ЗаказыСгруппированные.Количество - ЕСТЬNULL(ВТ_РеализацииСгруппированные.Количество, 0) КАК РазностьОбъемов,
		|	РАЗНОСТЬДАТ(ВТ_ЗаказыСгруппированные.ДатаОтгрузки, ЕСТЬNULL(ВТ_РеализацииСвернутые.Дата, ДАТАВРЕМЯ(1, 1, 1)), ДЕНЬ) КАК РазностьДат,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_ЗаказыСгруппированные.Количество - ЕСТЬNULL(ВТ_РеализацииСгруппированные.Количество, 0) = 0
		|			И ВТ_ПричинаНедопоставкиЗаказКлиента.ЗаказКлиента ЕСТЬ NULL
		|			ТОГДА ""1""
		|		КОГДА НЕ ВТ_ЗаказыСгруппированные.Количество - ЕСТЬNULL(ВТ_РеализацииСгруппированные.Количество, 0) = 0
		|				И НЕ ВТ_ПричинаНедопоставкиЗаказКлиента.ЗаказКлиента ЕСТЬ NULL
		|			ТОГДА ВТ_ПричинаНедопоставкиЗаказКлиента.Значение
		|		КОГДА НЕ РАЗНОСТЬДАТ(ВТ_ЗаказыСгруппированные.ДатаОтгрузки, ЕСТЬNULL(ВТ_РеализацииСвернутые.Дата, ДАТАВРЕМЯ(1, 1, 1)), ДЕНЬ) = 0
		|				И ВТ_ПричинаНедопоставкиЗаказКлиента.ЗаказКлиента ЕСТЬ NULL
		|			ТОГДА ""3""
		|		КОГДА НЕ РАЗНОСТЬДАТ(ВТ_ЗаказыСгруппированные.ДатаОтгрузки, ЕСТЬNULL(ВТ_РеализацииСвернутые.Дата, ДАТАВРЕМЯ(1, 1, 1)), ДЕНЬ) = 0
		|				И НЕ ВТ_ПричинаНедопоставкиЗаказКлиента.ЗаказКлиента ЕСТЬ NULL
		|			ТОГДА ВТ_ПричинаНедопоставкиЗаказКлиента.Значение
		|		КОГДА ВТ_РеализацииСвернутые.Ссылка ЕСТЬ NULL
		|				И ВТ_ПричинаНедопоставкиЗаказКлиента.ЗаказКлиента ЕСТЬ NULL
		|			ТОГДА ""2""
		|		КОГДА ВТ_РеализацииСвернутые.Ссылка ЕСТЬ NULL
		|				И НЕ ВТ_ПричинаНедопоставкиЗаказКлиента.ЗаказКлиента ЕСТЬ NULL
		|			ТОГДА ВТ_ПричинаНедопоставкиЗаказКлиента.Значение
		|		ИНАЧЕ ""9""
		|	КОНЕЦ КАК Причина,
		|	ВТ_ЗаказыСгруппированные.ДатаОтчета КАК ДатаОтчета
		|ИЗ
		|	ВТ_ЗаказыСгруппированные КАК ВТ_ЗаказыСгруппированные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеализацииСгруппированные КАК ВТ_РеализацииСгруппированные
		|		ПО (ВТ_ЗаказыСгруппированные.Ссылка = ВТ_РеализацииСгруппированные.ЗаказКлиента)
		|			И (ВТ_ЗаказыСгруппированные.Номенклатура = ВТ_РеализацииСгруппированные.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеализацииСвернутые КАК ВТ_РеализацииСвернутые
		|		ПО ВТ_ЗаказыСгруппированные.Ссылка = ВТ_РеализацииСвернутые.ЗаказКлиента
	    |		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПричинаНедопоставкиЗаказКлиента КАК ВТ_ПричинаНедопоставкиЗаказКлиента
		|		ПО ВТ_ЗаказыСгруппированные.Ссылка = ВТ_ПричинаНедопоставкиЗаказКлиента.ЗаказКлиента
		|	ГДЕ
		|		НЕ ВТ_ЗаказыСгруппированные.Количество - ЕСТЬNULL(ВТ_РеализацииСгруппированные.Количество, 0) = 0 ИЛИ 
		|		НЕ РАЗНОСТЬДАТ(ВТ_ЗаказыСгруппированные.ДатаОтгрузки, ЕСТЬNULL(ВТ_РеализацииСвернутые.Дата, ДАТАВРЕМЯ(1, 1, 1)), ДЕНЬ) = 0 ИЛИ 
		|		ВТ_РеализацииСвернутые.Ссылка ЕСТЬ NULL
		|ИТОГИ
		|	МАКСИМУМ(Шлюз),
		|	МАКСИМУМ(ВидОбмена),
		|	МАКСИМУМ(Пароль),
		|	МАКСИМУМ(ДатаОтчета),
		|	МАКСИМУМ(ФлагУдаления)
		|ПО
		|	ШлюзОрганизации
		|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВернутьТекстЗапросаСальдоПоТаре() Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
			|	ТЗ.ШлюзОрганизации КАК ШлюзОрганизации,
			|	ТЗ.Шлюз КАК Шлюз,
			|	ТЗ.ВидОбмена КАК ВидОбмена,
			|	ТЗ.ФлагУдаления КАК ФлагУдаления
			|ПОМЕСТИТЬ ВТ_ТЗ
			|ИЗ
			|	&ТЗ КАК ТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Mon_ШлюзыОрганизацииСклады.Ссылка.Наименование КАК Шлюз,
			|	Mon_ШлюзыОрганизацииСклады.Ссылка КАК ШлюзОрганизации,
			|	Mon_ШлюзыОрганизацииСклады.Ссылка.Пароль КАК Пароль,
			|	Mon_ШлюзыОрганизацииСклады.Ссылка.ТипМонолита КАК ТипМонолита,
			|	Mon_ШлюзыОрганизацииСклады.КодСклада КАК КодСклада,
			|	Mon_ШлюзыОрганизацииСклады.Склад КАК Склад,
			|	ВТ_ТЗ.ВидОбмена КАК ВидОбмена,
			|	ВТ_ТЗ.ФлагУдаления КАК ФлагУдаления
			|ПОМЕСТИТЬ ВТ_Склады
			|ИЗ
			|	ВТ_ТЗ КАК ВТ_ТЗ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Mon_ШлюзыОрганизации.Склады КАК Mon_ШлюзыОрганизацииСклады
			|		ПО ВТ_ТЗ.ШлюзОрганизации = Mon_ШлюзыОрганизацииСклады.Ссылка
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Mon_СоответствияНоменклатуры.Номенклатура КАК Номенклатура,
			|	Mon_СоответствияНоменклатуры.Упаковка КАК Упаковка,
			|	Mon_СоответствияНоменклатуры.УпаковкаМонолит КАК УпаковкаМонолит,
			|	Mon_СоответствияНоменклатуры.НоменклатураМонолит КАК НоменклатураМонолит
			|ПОМЕСТИТЬ ВТ_Сопоставления
			|ИЗ
			|	РегистрСведений.Mon_СоответствияНоменклатуры КАК Mon_СоответствияНоменклатуры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ВТ_Склады.ТипМонолита КАК ТипМонолита
			|		ИЗ
			|			ВТ_Склады КАК ВТ_Склады) КАК ВложенныйЗапрос
			|		ПО Mon_СоответствияНоменклатуры.ТипМонолита = ВложенныйЗапрос.ТипМонолита
			|ГДЕ (Mon_СоответствияНоменклатуры.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыИзмеряемыхВеличин.Объем)
			|				И Mon_СоответствияНоменклатуры.Коэффициент = 0.0333)
			|				ИЛИ (Mon_СоответствияНоменклатуры.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыИзмеряемыхВеличин.КоличествоШтук)
			|					И Mon_СоответствияНоменклатуры.Коэффициент = 1)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПереданнаяВозвратнаяТараОстатки.Партнер.Код КАК Код,
			|	ПереданнаяВозвратнаяТараОстатки.ДокументПередачи.Контрагент.ИНН КАК ИНН,
			|	ВТ_Сопоставления.НоменклатураМонолит КАК НоменклатураМонолит,
			|	СУММА(ПереданнаяВозвратнаяТараОстатки.КоличествоОстаток) КАК КоличествоОстаток,
			|	МАКСИМУМ(&ДатаОтчетаСтрокой) КАК ДатаОтчетаСтрокой,
			|	МАКСИМУМ(&ДатаОтчета) КАК ДатаОтчета,
			|	ВТ_Склады.Шлюз КАК Шлюз,
			|	ВТ_Склады.Пароль КАК Пароль,
			|	ВТ_Склады.ВидОбмена КАК ВидОбмена,
			|	ВТ_Склады.ФлагУдаления КАК ФлагУдаления,
			|	ВТ_Склады.ШлюзОрганизации КАК ШлюзОрганизации
			|ИЗ
			|	ВТ_Склады КАК ВТ_Склады
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПереданнаяВозвратнаяТара.Остатки(КОНЕЦПЕРИОДА(&ДатаОтчета, ДЕНЬ), Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)) КАК ПереданнаяВозвратнаяТараОстатки
			|		ПО ПереданнаяВозвратнаяТараОстатки.ДокументПередачи.Склад = ВТ_Склады.Склад
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сопоставления КАК ВТ_Сопоставления
	        |		ПО ПереданнаяВозвратнаяТараОстатки.Номенклатура = ВТ_Сопоставления.Номенклатура
			| ГДЕ
			| НЕ ПереданнаяВозвратнаяТараОстатки.Партнер ЕСТЬ NULL
			| 
			|СГРУППИРОВАТЬ ПО
			|	ПереданнаяВозвратнаяТараОстатки.Партнер.Код,
			|	ПереданнаяВозвратнаяТараОстатки.Номенклатура,
			|	ПереданнаяВозвратнаяТараОстатки.ДокументПередачи.Контрагент.ИНН,
			|	ВТ_Склады.Шлюз,
			|	ВТ_Склады.Пароль,
			|	ВТ_Склады.ВидОбмена,
			|	ВТ_Склады.ФлагУдаления,
			|	ВТ_Склады.ШлюзОрганизации,
			|	ВТ_Сопоставления.НоменклатураМонолит
			|ИТОГИ
			|	МАКСИМУМ(ДатаОтчетаСтрокой),
			|	МАКСИМУМ(ДатаОтчета),
			|	МАКСИМУМ(Шлюз),
			|	МАКСИМУМ(Пароль),
			|	МАКСИМУМ(ВидОбмена),
			|	МАКСИМУМ(ФлагУдаления)
			|ПО
			|	ШлюзОрганизации
			|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВернутьТекстЗапросаОстатков() Экспорт
	
	Возврат "ВЫБРАТЬ
	        |	ТЗ.ШлюзОрганизации КАК ШлюзОрганизации,
	        |	ТЗ.Шлюз КАК Шлюз,
	        |	ТЗ.ВидОбмена КАК ВидОбмена,
	        |	ТЗ.ФлагУдаления КАК ФлагУдаления
	        |ПОМЕСТИТЬ ВТ_ТЗ
	        |ИЗ
	        |	&ТЗ КАК ТЗ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Mon_ШлюзыОрганизацииСклады.Ссылка КАК Ссылка,
			|	Mon_ШлюзыОрганизацииСклады.Ссылка.ТипМонолита КАК ТипМонолита,
			|	Mon_ШлюзыОрганизацииСклады.Ссылка.Пароль КАК Пароль,
	        |	Mon_ШлюзыОрганизацииСклады.КодСклада КАК КодСклада,
	        |	Mon_ШлюзыОрганизацииСклады.Склад КАК Склад,
	        |	ВТ_ТЗ.ВидОбмена КАК ВидОбмена,
	        |	ВТ_ТЗ.ФлагУдаления КАК ФлагУдаления
	        |ПОМЕСТИТЬ ВТ_Склады
	        |ИЗ
	        |	ВТ_ТЗ КАК ВТ_ТЗ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Mon_ШлюзыОрганизации.Склады КАК Mon_ШлюзыОрганизацииСклады
	        |		ПО ВТ_ТЗ.ШлюзОрганизации = Mon_ШлюзыОрганизацииСклады.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Mon_СоответствияНоменклатуры.Номенклатура КАК Номенклатура,
			|	Mon_СоответствияНоменклатуры.Упаковка КАК Упаковка,
			|	Mon_СоответствияНоменклатуры.УпаковкаМонолит КАК УпаковкаМонолит,
			|	Mon_СоответствияНоменклатуры.НоменклатураМонолит КАК НоменклатураМонолит
			|ПОМЕСТИТЬ ВТ_Сопоставления
			|ИЗ
			|	РегистрСведений.Mon_СоответствияНоменклатуры КАК Mon_СоответствияНоменклатуры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ВТ_Склады.ТипМонолита КАК ТипМонолита
			|		ИЗ
			|			ВТ_Склады КАК ВТ_Склады) КАК ВложенныйЗапрос
			|		ПО Mon_СоответствияНоменклатуры.ТипМонолита = ВложенныйЗапрос.ТипМонолита
			|ГДЕ (Mon_СоответствияНоменклатуры.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыИзмеряемыхВеличин.Объем)
			|				И Mon_СоответствияНоменклатуры.Коэффициент = 0.0333)
			|				ИЛИ (Mon_СоответствияНоменклатуры.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыИзмеряемыхВеличин.КоличествоШтук)
			|					И Mon_СоответствияНоменклатуры.Коэффициент = 1)
			|;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Склады.Склад КАК Склад,
	        |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	        |	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	        |	ВТ_Сопоставления.НоменклатураМонолит КАК НоменклатураМонолит,
	        |	ВТ_Сопоставления.УпаковкаМонолит КАК УпаковкаМонолит,
			|	ВТ_Склады.Ссылка КАК ШлюзОрганизации,
	        |	ВТ_Склады.Ссылка.Наименование КАК Шлюз,
			|	ВТ_Склады.Пароль КАК Пароль,
	        |	ВТ_Склады.ВидОбмена КАК ВидОбмена,
			|	&ДатаОтчета КАК ДатаОтчета,
	        |	&ДатаОтчетаСтрокой КАК ДатаОтчетаСтрокой,
	        |	ВТ_Склады.КодСклада КАК КодСклада,
	        |	ВТ_Склады.ФлагУдаления КАК ФлагУдаления
	        |ИЗ
	        |	РегистрНакопления.ТоварыНаСкладах.Остатки(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаОтчета, ДЕНЬ), СЕКУНДА, 1), ) КАК ТоварыНаСкладахОстатки
	        |		ПРАВОЕ СОЕДИНЕНИЕ ВТ_Склады КАК ВТ_Склады
	        |		ПО ТоварыНаСкладахОстатки.Склад = ВТ_Склады.Склад
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сопоставления КАК ВТ_Сопоставления
	        |		ПО ТоварыНаСкладахОстатки.Номенклатура = ВТ_Сопоставления.Номенклатура
	        |ИТОГИ
	        |	МАКСИМУМ(ДатаОтчетаСтрокой),
			|	МАКСИМУМ(ДатаОтчета),
	        |	МАКСИМУМ(КодСклада),
			|	МАКСИМУМ(ВидОбмена),
			|	МАКСИМУМ(Пароль),
			|	МАКСИМУМ(ФлагУдаления),
			|	МАКСИМУМ(ШлюзОрганизации)
	        |ПО
	        |	Шлюз,
	        |	Склад";

	
КонецФункции

Функция ВернутьТекстЗапросаОстатковПоПартиям() Экспорт
	
	Возврат "ВЫБРАТЬ
	        |	ТЗ.ШлюзОрганизации КАК ШлюзОрганизации,
	        |	ТЗ.Шлюз КАК Шлюз,
	        |	ТЗ.ВидОбмена КАК ВидОбмена,
	        |	ТЗ.ФлагУдаления КАК ФлагУдаления
	        |ПОМЕСТИТЬ ВТ_ТЗ
	        |ИЗ
	        |	&ТЗ КАК ТЗ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Mon_ШлюзыОрганизацииСклады.Ссылка КАК Ссылка,
	        |	Mon_ШлюзыОрганизацииСклады.КодСклада КАК КодСклада,
	        |	Mon_ШлюзыОрганизацииСклады.Склад КАК Склад,
			|	Mon_ШлюзыОрганизацииСклады.Ссылка.ТипМонолита КАК ТипМонолита,
	        |	ВТ_ТЗ.ВидОбмена КАК ВидОбмена,
	        |	ВТ_ТЗ.ФлагУдаления КАК ФлагУдаления
	        |ПОМЕСТИТЬ ВТ_Склады
	        |ИЗ
	        |	ВТ_ТЗ КАК ВТ_ТЗ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Mon_ШлюзыОрганизации.Склады КАК Mon_ШлюзыОрганизацииСклады
	        |		ПО ВТ_ТЗ.ШлюзОрганизации = Mon_ШлюзыОрганизацииСклады.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Mon_СоответствияНоменклатуры.Номенклатура КАК Номенклатура,
			|	Mon_СоответствияНоменклатуры.Упаковка КАК Упаковка,
			|	Mon_СоответствияНоменклатуры.УпаковкаМонолит КАК УпаковкаМонолит,
			|	Mon_СоответствияНоменклатуры.НоменклатураМонолит КАК НоменклатураМонолит
			|ПОМЕСТИТЬ ВТ_Сопоставления
			|ИЗ
			|	РегистрСведений.Mon_СоответствияНоменклатуры КАК Mon_СоответствияНоменклатуры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			ВТ_Склады.ТипМонолита КАК ТипМонолита
			|		ИЗ
			|			ВТ_Склады КАК ВТ_Склады) КАК ВложенныйЗапрос
			|		ПО Mon_СоответствияНоменклатуры.ТипМонолита = ВложенныйЗапрос.ТипМонолита
			|ГДЕ (Mon_СоответствияНоменклатуры.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыИзмеряемыхВеличин.Объем)
			|				И Mon_СоответствияНоменклатуры.Коэффициент = 0.0333)
			|				ИЛИ (Mon_СоответствияНоменклатуры.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыИзмеряемыхВеличин.КоличествоШтук)
			|					И Mon_СоответствияНоменклатуры.Коэффициент = 1)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Склады.Склад КАК Склад,
	        |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	        |	ТоварыНаСкладахОстатки.Серия КАК Серия,
	        |	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	        |	ВТ_Сопоставления.НоменклатураМонолит КАК НоменклатураМонолит,
	        |	ВТ_Сопоставления.УпаковкаМонолит КАК УпаковкаМонолит,
	        |	ВТ_Склады.Ссылка КАК ШлюзОрганизации,
			|	ВТ_Склады.Ссылка.Наименование КАК Шлюз,
			|	ВТ_Склады.Ссылка.Пароль КАК Пароль,
	        |	ВТ_Склады.ФлагУдаления КАК ФлагУдаления,
	        |	ВТ_Склады.ВидОбмена КАК ВидОбмена,
	        |	&ДатаОтчетаСтрокой КАК ДатаОтчетаСтрокой,
			|	&ДатаОтчета КАК ДатаОтчета,
	        |	ВТ_Склады.КодСклада КАК КодСклада,
	        |	ТоварыНаСкладахОстатки.Серия.ДатаПроизводства КАК СерияДатаПроизводства,
	        |	ТоварыНаСкладахОстатки.Серия.ГоденДо КАК СерияГоденДо
	        |ИЗ
	        |	РегистрНакопления.ТоварыНаСкладах.Остатки(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаОтчета, ДЕНЬ), СЕКУНДА, 1), ) КАК ТоварыНаСкладахОстатки
	        |		ПРАВОЕ СОЕДИНЕНИЕ ВТ_Склады КАК ВТ_Склады
	        |		ПО ТоварыНаСкладахОстатки.Склад = ВТ_Склады.Склад
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сопоставления КАК ВТ_Сопоставления
	        |		ПО ТоварыНаСкладахОстатки.Номенклатура = ВТ_Сопоставления.Номенклатура
	        |ИТОГИ
	        |	МАКСИМУМ(ДатаОтчетаСтрокой),
			|	МАКСИМУМ(ДатаОтчета),
	        |	МАКСИМУМ(КодСклада),
			|	МАКСИМУМ(ШлюзОрганизации),
			|	МАКСИМУМ(Пароль),
			|	МАКСИМУМ(ВидОбмена),
			|	МАКСИМУМ(ФлагУдаления)
	        |ПО
	        |	Шлюз,
	        |	Склад";
	
КонецФункции

Функция ВернутьТекстЗапросаДвижений() Экспорт
	
	Возврат "ВЫБРАТЬ
		|	ТЗ.ШлюзОрганизации КАК ШлюзОрганизации,
		|	ТЗ.Шлюз КАК Шлюз,
		|	ТЗ.ВидОбмена КАК ВидОбмена,
		|	ТЗ.ФлагУдаления КАК ФлагУдаления
		|ПОМЕСТИТЬ ВТ_ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Mon_ШлюзыОрганизацииСклады.Ссылка КАК ШлюзОрганизации,
		|	Mon_ШлюзыОрганизацииСклады.Ссылка.Пароль КАК Пароль,
		|	Mon_ШлюзыОрганизацииСклады.Ссылка.Наименование КАК Шлюз,
		|	Mon_ШлюзыОрганизацииСклады.Ссылка.ТипМонолита КАК ТипМонолита,
		|	Mon_ШлюзыОрганизацииСклады.КодСклада КАК КодСклада,
		|	Mon_ШлюзыОрганизацииСклады.Склад КАК Склад,
		|	Mon_ШлюзыОрганизацииСклады.Склад.РозничныйВидЦены КАК РозничныйВидЦены,
		|	Mon_ШлюзыОрганизацииСклады.ПартнерДляРозницы КАК Партнер,
		|	Mon_ШлюзыОрганизацииСклады.КонтрагентДляРозницы КАК Контрагент,
		|	ВТ_ТЗ.ВидОбмена КАК ВидОбмена,
		|	ВТ_ТЗ.ФлагУдаления КАК ФлагУдаления
		|ПОМЕСТИТЬ ВТ_Склады
		|ИЗ
		|	ВТ_ТЗ КАК ВТ_ТЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Mon_ШлюзыОрганизации.Склады КАК Mon_ШлюзыОрганизацииСклады
		|		ПО ВТ_ТЗ.ШлюзОрганизации = Mon_ШлюзыОрганизацииСклады.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Mon_СоответствияНоменклатуры.Номенклатура КАК Номенклатура,
		|	Mon_СоответствияНоменклатуры.Упаковка КАК Упаковка,
		|	Mon_СоответствияНоменклатуры.УпаковкаМонолит КАК УпаковкаМонолит,
		|	Mon_СоответствияНоменклатуры.НоменклатураМонолит КАК НоменклатураМонолит,
		|	Mon_СоответствияНоменклатуры.Коэффициент КАК Коэффициент
		|ПОМЕСТИТЬ ВТ_Сопоставления
		|ИЗ
		|	РегистрСведений.Mon_СоответствияНоменклатуры КАК Mon_СоответствияНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ВТ_Склады.ТипМонолита КАК ТипМонолита
		|		ИЗ
		|			ВТ_Склады КАК ВТ_Склады) КАК ВложенныйЗапрос
		|		ПО Mon_СоответствияНоменклатуры.ТипМонолита = ВложенныйЗапрос.ТипМонолита
		|ГДЕ (Mon_СоответствияНоменклатуры.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыИзмеряемыхВеличин.Объем)
		|				И Mon_СоответствияНоменклатуры.Коэффициент = 0.0333)
		|				ИЛИ (Mon_СоответствияНоменклатуры.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыИзмеряемыхВеличин.КоличествоШтук)
		|					И Mon_СоответствияНоменклатуры.Коэффициент = 1)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|	ПОМЕСТИТЬ ВТ_ЦЕНЫ
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних( КОНЕЦПЕРИОДА(&ДатаОтчета, ДЕНЬ), Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) 
		|	И ВидЦены В (ВЫБРАТЬ РАЗЛИЧНЫЕ РозничныйВидЦены ИЗ ВТ_Склады)) КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.Цена > 0
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Объект,
		|	ДополнительныеСведения.Свойство КАК Свойство,
		|	ДополнительныеСведения.Значение КАК Значение
		|ПОМЕСТИТЬ ВТ_ВнутриГрупповыеКонтрагенты
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Справочник.Партнеры
		|	И ДополнительныеСведения.Свойство.Имя = ""КодШлюзабалтикаПартнеры""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Объект,
		|	ДополнительныеСведения.Свойство КАК Свойство,
		|	ДополнительныеСведения.Значение КАК Значение
		|ПОМЕСТИТЬ ВТ_СторонниеДистрибьюторы
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Справочник.Партнеры
		|	И ДополнительныеСведения.Свойство.Имя = ""СтороннийДистрибьюторбалтикаПартнеры""
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Объект,
		|	ДополнительныеСведения.Свойство КАК Свойство,
		|	ДополнительныеСведения.Значение КАК Значение
		|ПОМЕСТИТЬ ВТ_НомераПоступленийОтБалтики
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Документ.ПриобретениеТоваровУслуг
		|	И ДополнительныеСведения.Свойство.Имя = ""ВнешнийКодПриобретениеТоваровУслуг""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Объект,
		|	ДополнительныеСведения.Свойство КАК Свойство,
		|	ДополнительныеСведения.Значение КАК Значение
		|ПОМЕСТИТЬ ВТ_ДатыПоступленийОтБалтики
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Документ.ПриобретениеТоваровУслуг
		|	И ДополнительныеСведения.Свойство.Имя = ""ВнешняяДатаПриобретениеТоваровУслуг""
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Объект,
		|	ДополнительныеСведения.Свойство КАК Свойство,
		|	ДополнительныеСведения.Значение КАК Значение
		|ПОМЕСТИТЬ ВТ_НомераПеремещениеТоваров
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Документ.ПеремещениеТоваров
		|	И ДополнительныеСведения.Свойство.Имя = ""НомерЗаказаМонолитПеремещениеТоваров""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Объект,
		|	ДополнительныеСведения.Свойство КАК Свойство,
		|	ДополнительныеСведения.Значение КАК Значение
		|ПОМЕСТИТЬ ВТ_ДатыПеремещениеТоваров
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Документ.ПеремещениеТоваров
		|	И ДополнительныеСведения.Свойство.Имя = ""ДатаЗаказаМонолитПеремещениеТоваров""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Объект,
		|	ДополнительныеСведения.Свойство КАК Свойство,
		|	ДополнительныеСведения.Значение КАК Значение
		|ПОМЕСТИТЬ ВТ_ОсновныеПоставщики
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Справочник.Партнеры
		|	И ДополнительныеСведения.Свойство.Имя = ""ОсновнойПоставщикбалтикаПартнеры""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПартнерыДополнительныеРеквизиты.Ссылка КАК Ссылка,
		|	ПартнерыДополнительныеРеквизиты.Значение.ПолноеНаименование КАК Значение
		|ПОМЕСТИТЬ ВТ_КаналыПродаж
		|ИЗ
		|	Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|ГДЕ
		|	ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""КаналСбытаБалтикаПартнеры""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПартнерыДополнительныеРеквизиты.Ссылка КАК Ссылка,
		|	ПартнерыДополнительныеРеквизиты.Значение.ПолноеНаименование КАК Значение
		|ПОМЕСТИТЬ ВТ_РегионыПродаж
		|ИЗ
		|	Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
		|ГДЕ
		|	ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""РегионБалтикаПартнеры""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Партнер,
		|	ДополнительныеСведения.Значение КАК КодТорговойТочки
		|ПОМЕСТИТЬ ВТ_СоответствияТорговыхТочек
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Справочник.Партнеры
		|	И ДополнительныеСведения.Свойство.Имя = ""КодМонолитБалтикаПартнеры""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Объект,
		|	ДополнительныеСведения.Свойство КАК Свойство,
		|	ДополнительныеСведения.Значение КАК Значение
		|ПОМЕСТИТЬ ВТ_КодировкаСкидок
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Справочник.СкидкиНаценки
		|	И ДополнительныеСведения.Свойство.Имя = ""КодАкции""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОбороты.Период КАК Период,
		|	ТоварыНаСкладахОбороты.Регистратор КАК Регистратор,
		|	МИНИМУМ(ТоварыНаСкладахОбороты.НомерСтроки) КАК НомерСтроки,
		|	ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОбороты.Склад КАК Склад,
		|	ТоварыНаСкладахОбороты.Серия КАК Серия,
		|	СУММА(ТоварыНаСкладахОбороты.ВНаличииОборот) КАК ВНаличииОборот
		|ПОМЕСТИТЬ ВТ_Движения
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(
		|			НАЧАЛОПЕРИОДА(&ДатаОтчета, ДЕНЬ),
		|			КОНЕЦПЕРИОДА(&ДатаОтчета, ДЕНЬ),
		|			Запись,
		|			СКЛАД В
		|				(ВЫБРАТЬ
		|					ВТ_Склады.Склад
		|				ИЗ
		|					ВТ_Склады КАК ВТ_Склады)) КАК ТоварыНаСкладахОбороты
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОбороты.Период,
		|	ТоварыНаСкладахОбороты.Регистратор,
		|	ТоварыНаСкладахОбороты.Номенклатура,
		|	ТоварыНаСкладахОбороты.Склад,
		|	ТоварыНаСкладахОбороты.Серия
		|
		|
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Движения.Период КАК Период,
		|	ВТ_Движения.Регистратор КАК Регистратор,
		|	ВТ_Движения.Номенклатура КАК Номенклатура,
		|	СУММА(ВТ_Движения.ВНаличииОборот) КАК ВНаличииОборот
		|ПОМЕСТИТЬ ВТ_СгруппированныеДвижения
		|ИЗ
		|	ВТ_Движения КАК ВТ_Движения
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Движения.Период,
		|	ВТ_Движения.Регистратор,
		|	ВТ_Движения.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Движения.Период КАК Период,
		|	ВТ_Движения.Регистратор КАК Регистратор,
		|	ВТ_Движения.НомерСтроки КАК НомерСтроки,
		|	ВТ_Движения.Номенклатура КАК Номенклатура,
		|	ВТ_Движения.Склад КАК Склад,
		|	ВТ_Движения.Серия КАК Серия,
		|	ВТ_Движения.ВНаличииОборот КАК КоличествоИзСерии,
		|	ВТ_СгруппированныеДвижения.ВНаличииОборот КАК ОбщееКоличествоНоменклатуры
		|ПОМЕСТИТЬ ВТ_ДвиженияИСгруппированныеДвижения
		|ИЗ
		|	ВТ_Движения КАК ВТ_Движения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СгруппированныеДвижения КАК ВТ_СгруппированныеДвижения
		|		ПО ВТ_Движения.Регистратор = ВТ_СгруппированныеДвижения.Регистратор
		|			И ВТ_Движения.Номенклатура = ВТ_СгруппированныеДвижения.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СгруппированныеДвижения.Регистратор КАК Регистратор,
		|	РеализацияТоваровУслугСкидкиНаценки.КлючСвязи КАК КлючСвязи,
		|	МАКСИМУМ(РеализацияТоваровУслугСкидкиНаценки.СкидкаНаценка) КАК СкидкаНаценка
		|ПОМЕСТИТЬ ВТ_Скидки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.СкидкиНаценки КАК РеализацияТоваровУслугСкидкиНаценки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СгруппированныеДвижения КАК ВТ_СгруппированныеДвижения
		|		ПО (ВТ_СгруппированныеДвижения.Регистратор = РеализацияТоваровУслугСкидкиНаценки.Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СгруппированныеДвижения.Регистратор,
		|	РеализацияТоваровУслугСкидкиНаценки.КлючСвязи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ВнутриГрупповыеКонтрагенты.Значение, """") <> """"
		|			ТОГДА ""MovingNoteFrom""
		|		КОГДА ЕСТЬNULL(ВТ_СторонниеДистрибьюторы.Значение, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ""DespatchDistr""
		|		КОГДА ВТ_ОсновныеПоставщики.Значение = ИСТИНА
		|			ТОГДА ""VendReturn""
		|		КОГДА ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Контрагент = Значение(Справочник.Контрагенты.Розничныйпокупатель)
		|			ТОГДА ""ProdReceipt""
		|		ИНАЧЕ ""Despatch""
		|	КОНЕЦ КАК НазваниеДокумента,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Период КАК Период,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Номер КАК РегистраторНомер,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор КАК Регистратор,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.ЗаказКлиента.НомерПоДаннымКлиента КАК ЗаказКлиентаНомерПоДаннымКлиента,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.ЗаказКлиента.ДатаПоДаннымКлиента КАК ЗаказКлиентаДатаПоДаннымКлиента,
		|	ВТ_ДвиженияИСгруппированныеДвижения.НомерСтроки КАК НомерСтроки,
		|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтрокиЦена,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Номенклатура КАК Номенклатура,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Склад КАК Склад,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Серия КАК Серия,
		|	-ВТ_ДвиженияИСгруппированныеДвижения.КоличествоИзСерии КАК КоличествоИзСерии,
		|	-ВТ_ДвиженияИСгруппированныеДвижения.ОбщееКоличествоНоменклатуры КАК ОбщееКоличествоНоменклатуры,
		|	РеализацияТоваровУслугТовары.Количество КАК КоличествоИзТовары,
		|	РеализацияТоваровУслугТовары.Сумма / РеализацияТоваровУслугТовары.Количество КАК Цена,
		|	РеализацияТоваровУслугТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	РеализацияТоваровУслугТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	ВТ_Скидки.СкидкаНаценка КАК СкидкаНаценка,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Контрагент КАК Контрагент,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер КАК Партнер,
		|	ВТ_КаналыПродаж.Значение КАК КаналПродаж,
		|	ВТ_РегионыПродаж.Значение КАК РегионПродаж,
		|	ВТ_КодировкаСкидок.Значение КАК КодАкции,
		|	ВТ_ВнутриГрупповыеКонтрагенты.Значение КАК SrcCRMDbId
		|ПОМЕСТИТЬ ВТ_Реализации
		|ИЗ
		|	ВТ_ДвиженияИСгруппированныеДвижения КАК ВТ_ДвиженияИСгруппированныеДвижения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор = РеализацияТоваровУслугТовары.Ссылка
		|			И ВТ_ДвиженияИСгруппированныеДвижения.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Скидки КАК ВТ_Скидки
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодировкаСкидок КАК ВТ_КодировкаСкидок
		|			ПО ВТ_Скидки.СкидкаНаценка = ВТ_КодировкаСкидок.Объект
		|		ПО (РеализацияТоваровУслугТовары.Ссылка = ВТ_Скидки.Регистратор)
		|			И (РеализацияТоваровУслугТовары.НомерСтроки = ВТ_Скидки.КлючСвязи)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВнутриГрупповыеКонтрагенты КАК ВТ_ВнутриГрупповыеКонтрагенты
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер = ВТ_ВнутриГрупповыеКонтрагенты.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СторонниеДистрибьюторы КАК ВТ_СторонниеДистрибьюторы
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер = ВТ_СторонниеДистрибьюторы.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновныеПоставщики КАК ВТ_ОсновныеПоставщики
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер = ВТ_ОсновныеПоставщики.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КаналыПродаж КАК ВТ_КаналыПродаж
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер = ВТ_КаналыПродаж.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегионыПродаж КАК ВТ_РегионыПродаж
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер = ВТ_РегионыПродаж.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Скидки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ВнутриГрупповыеКонтрагенты.Значение, """") <> """"
		|			ТОГДА ""MovingNoteTo""
		|		КОГДА ЕСТЬNULL(ВТ_СторонниеДистрибьюторы.Значение, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ""VendReceiptDist""
		|		КОГДА ЕСТЬNULL(ВТ_ОсновныеПоставщики.Значение, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ""VendReceipt""
		|		ИНАЧЕ ""VendReceiptEx""
		|	КОНЕЦ КАК НазваниеДокумента,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Период КАК Период,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Номер КАК РегистраторНомер,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор КАК Регистратор,
		|	ВТ_ДвиженияИСгруппированныеДвижения.НомерСтроки КАК НомерСтроки,
		|	ПриобретениеТоваровУслугТовары.НомерСтроки КАК НомерСтрокиЦена,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Номенклатура КАК Номенклатура,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Склад КАК Склад,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Серия КАК Серия,
		|	ВТ_ДвиженияИСгруппированныеДвижения.КоличествоИзСерии КАК КоличествоИзСерии,
		|	ВТ_ДвиженияИСгруппированныеДвижения.ОбщееКоличествоНоменклатуры КАК ОбщееКоличествоНоменклатуры,
		|	ПриобретениеТоваровУслугТовары.Количество КАК КоличествоИзТовары,
		|	ПриобретениеТоваровУслугТовары.Цена КАК Цена,
		|	ВТ_НомераПоступленийОтБалтики.Значение КАК НомерВходящегоДокумента,
		|	ВТ_ДатыПоступленийОтБалтики.Значение КАК ДатаВходящегоДокумента,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Контрагент КАК Контрагент,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер КАК Партнер,
		|	ВТ_ВнутриГрупповыеКонтрагенты.Значение КАК SrcCRMDbId
		|ПОМЕСТИТЬ ВТ_ПриобретенияТоваровУслуг
		|ИЗ
		|	ВТ_ДвиженияИСгруппированныеДвижения КАК ВТ_ДвиженияИСгруппированныеДвижения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор = ПриобретениеТоваровУслугТовары.Ссылка
		|			И ВТ_ДвиженияИСгруппированныеДвижения.Номенклатура = ПриобретениеТоваровУслугТовары.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВнутриГрупповыеКонтрагенты КАК ВТ_ВнутриГрупповыеКонтрагенты
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер = ВТ_ВнутриГрупповыеКонтрагенты.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СторонниеДистрибьюторы КАК ВТ_СторонниеДистрибьюторы
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер = ВТ_СторонниеДистрибьюторы.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновныеПоставщики КАК ВТ_ОсновныеПоставщики
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер = ВТ_ОсновныеПоставщики.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор = ДополнительныеСведения.Объект
		|			И (ДополнительныеСведения.Свойство.Заголовок = ""Поступление от поставщика"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераПоступленийОтБалтики КАК ВТ_НомераПоступленийОтБалтики
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор = ВТ_НомераПоступленийОтБалтики.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыПоступленийОтБалтики КАК ВТ_ДатыПоступленийОтБалтики
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор = ВТ_ДатыПоступленийОтБалтики.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ВнутриГрупповыеКонтрагенты.Значение, """") <> """"
		|			ТОГДА ""MovingNoteTo""
		|		ИНАЧЕ ""CustReturn""
		|	КОНЕЦ КАК НазваниеДокумента,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Период КАК Период,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Номер КАК РегистраторНомер,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор КАК Регистратор,
		|	ВТ_ДвиженияИСгруппированныеДвижения.НомерСтроки КАК НомерСтроки,
		|	ВозвратТоваровОтКлиентаТовары.НомерСтроки КАК НомерСтрокиЦена,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Номенклатура КАК Номенклатура,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Склад КАК Склад,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Серия КАК Серия,
		|	ВТ_ДвиженияИСгруппированныеДвижения.КоличествоИзСерии КАК КоличествоИзСерии,
		|	ВТ_ДвиженияИСгруппированныеДвижения.ОбщееКоличествоНоменклатуры КАК ОбщееКоличествоНоменклатуры,
		|	ВозвратТоваровОтКлиентаТовары.Количество КАК КоличествоИзТовары,
		|	ВозвратТоваровОтКлиентаТовары.Сумма / ВозвратТоваровОтКлиентаТовары.Количество КАК Цена,
		|	ВозвратТоваровОтКлиентаТовары.Сумма КАК Сумма,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер КАК Партнер,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Контрагент КАК Контрагент,
		|	ВТ_КаналыПродаж.Значение КАК КаналПродаж,
		|	ВТ_РегионыПродаж.Значение КАК РегионПродаж,
		|	ВТ_ВнутриГрупповыеКонтрагенты.Значение КАК SrcCRMDbId
		|ПОМЕСТИТЬ ВТ_ВозвратТоваровОтКлиента
		|ИЗ
		|	ВТ_ДвиженияИСгруппированныеДвижения КАК ВТ_ДвиженияИСгруппированныеДвижения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента.Товары КАК ВозвратТоваровОтКлиентаТовары
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор = ВозвратТоваровОтКлиентаТовары.Ссылка
		|			И ВТ_ДвиженияИСгруппированныеДвижения.Номенклатура = ВозвратТоваровОтКлиентаТовары.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВнутриГрупповыеКонтрагенты КАК ВТ_ВнутриГрупповыеКонтрагенты
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер = ВТ_ВнутриГрупповыеКонтрагенты.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КаналыПродаж КАК ВТ_КаналыПродаж
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер = ВТ_КаналыПродаж.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегионыПродаж КАК ВТ_РегионыПродаж
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер = ВТ_РегионыПродаж.Ссылка
		
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВЫБОР
		|		КОГДА ВТ_ОсновныеПоставщики.Значение ЕСТЬ NULL
		|				ИЛИ ВТ_ОсновныеПоставщики.Значение = ИСТИНА
		|			ТОГДА ""VendReturn""
		|		КОГДА ВТ_ВнутриГрупповыеКонтрагенты.Значение ЕСТЬ NULL
		|				ИЛИ ВТ_ВнутриГрупповыеКонтрагенты.Значение <> """"
		|			ТОГДА ""MovingNoteFrom""
		|		ИНАЧЕ ""VendReturnEx""
		|	КОНЕЦ) КАК НазваниеДокумента,
		|	МИНИМУМ(ВТ_ДвиженияИСгруппированныеДвижения.Период) КАК Период,
		|	МИНИМУМ(ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Номер) КАК РегистраторНомер,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор КАК Регистратор,
		|	МИНИМУМ(ВТ_ДвиженияИСгруппированныеДвижения.НомерСтроки) КАК НомерСтроки,
		|	МИНИМУМ(ВозвратТоваровПоставщикуТовары.НомерСтроки) КАК НомерСтрокиЦена,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Номенклатура КАК Номенклатура,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Склад КАК Склад,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Серия КАК Серия,
		|	МИНИМУМ(- ВТ_ДвиженияИСгруппированныеДвижения.КоличествоИзСерии) КАК КоличествоИзСерии,
		|	МИНИМУМ(- ВТ_ДвиженияИСгруппированныеДвижения.ОбщееКоличествоНоменклатуры) КАК ОбщееКоличествоНоменклатуры,
		|	СУММА(ВозвратТоваровПоставщикуТовары.Количество) КАК КоличествоИзТовары,
		|	МИНИМУМ(ВозвратТоваровПоставщикуТовары.Цена) КАК Цена,
		|	МИНИМУМ(ВозвратТоваровПоставщикуТовары.Сумма) КАК Сумма,
		|	МИНИМУМ(ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Контрагент) КАК Контрагент,
		|	МИНИМУМ(ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер) КАК Партнер,
		|	МИНИМУМ(ВТ_ВнутриГрупповыеКонтрагенты.Значение) КАК SrcCRMDbId
		|ПОМЕСТИТЬ ВТ_ВозвратТоваровПоставщику
		|ИЗ
		|	ВТ_ДвиженияИСгруппированныеДвижения КАК ВТ_ДвиженияИСгруппированныеДвижения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор = ВозвратТоваровПоставщикуТовары.Ссылка
		|			И ВТ_ДвиженияИСгруппированныеДвижения.Номенклатура = ВозвратТоваровПоставщикуТовары.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВнутриГрупповыеКонтрагенты КАК ВТ_ВнутриГрупповыеКонтрагенты
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер = ВТ_ВнутриГрупповыеКонтрагенты.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СторонниеДистрибьюторы КАК ВТ_СторонниеДистрибьюторы
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер = ВТ_СторонниеДистрибьюторы.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновныеПоставщики КАК ВТ_ОсновныеПоставщики
		|		ПО ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Партнер = ВТ_ОсновныеПоставщики.Объект
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Номенклатура,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Склад,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НЕ ВТ_ДвиженияИСгруппированныеДвижения.КоличествоИзСерии > 0
		|			ТОГДА ""ProdReceipt""
		|		ИНАЧЕ ""ProdReturn""
		|	КОНЕЦ КАК НазваниеДокумента,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Период КАК Период,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор.Номер КАК РегистраторНомер,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Регистратор КАК Регистратор,
		|	ВТ_ДвиженияИСгруппированныеДвижения.НомерСтроки КАК НомерСтроки,
		|	ВТ_ДвиженияИСгруппированныеДвижения.НомерСтроки КАК НомерСтрокиЦена,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Номенклатура КАК Номенклатура,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Склад КАК Склад,
		|	ВТ_ДвиженияИСгруппированныеДвижения.Серия КАК Серия,
		|	ВЫБОР
		|		КОГДА ВТ_ДвиженияИСгруппированныеДвижения.КоличествоИзСерии > 0
		|			ТОГДА ВТ_ДвиженияИСгруппированныеДвижения.КоличествоИзСерии
		|		ИНАЧЕ - ВТ_ДвиженияИСгруппированныеДвижения.КоличествоИзСерии
		|	КОНЕЦ КАК КоличествоИзСерии,
		|	ВЫБОР
		|		КОГДА ВТ_ДвиженияИСгруппированныеДвижения.КоличествоИзСерии > 0
		|			ТОГДА ВТ_ДвиженияИСгруппированныеДвижения.КоличествоИзСерии
		|		ИНАЧЕ - ВТ_ДвиженияИСгруппированныеДвижения.КоличествоИзСерии
		|	КОНЕЦ КАК ОбщееКоличествоНоменклатуры,
		|	ВЫБОР
		|		КОГДА ВТ_ДвиженияИСгруппированныеДвижения.КоличествоИзСерии > 0
		|			ТОГДА ВТ_ДвиженияИСгруппированныеДвижения.КоличествоИзСерии
		|		ИНАЧЕ - ВТ_ДвиженияИСгруппированныеДвижения.КоличествоИзСерии
		|	КОНЕЦ КАК КоличествоИзТовары
		|ПОМЕСТИТЬ ВТ_Пересорт
		|ИЗ
		|	ВТ_ДвиженияИСгруппированныеДвижения КАК ВТ_ДвиженияИСгруппированныеДвижения
		|ГДЕ
		|	(ВТ_ДвиженияИСгруппированныеДвижения.Регистратор ССЫЛКА Документ.ОрдерНаОтражениеИзлишковТоваров
		|			ИЛИ ВТ_ДвиженияИСгруппированныеДвижения.Регистратор ССЫЛКА Документ.ОрдерНаОтражениеНедостачТоваров
		|			ИЛИ ВТ_ДвиженияИСгруппированныеДвижения.Регистратор ССЫЛКА Документ.ОрдерНаОтражениеПересортицыТоваров
		|			ИЛИ ВТ_ДвиженияИСгруппированныеДвижения.Регистратор ССЫЛКА Документ.ПересчетТоваров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_Движения.ВНаличииОборот > 0
		|			ТОГДА ""MovingNoteTo""
		|		ИНАЧЕ ""MovingNoteFrom""
		|	КОНЕЦ КАК НазваниеДокумента,
		|	ВТ_Движения.Период КАК Период,
		|	ВТ_Движения.Регистратор.Номер КАК РегистраторНомер,
		|	ВТ_Движения.Регистратор КАК Регистратор,
		|	ВТ_Движения.НомерСтроки КАК НомерСтроки,
		|	ВТ_Движения.НомерСтроки КАК НомерСтрокиЦена,
		|	ВТ_Движения.Номенклатура КАК Номенклатура,
		|	ВТ_Движения.Склад КАК Склад,
		|	ВТ_Движения.Серия КАК Серия,
		|	ВЫБОР
		|		КОГДА ВТ_Движения.ВНаличииОборот > 0
		|			ТОГДА ВТ_Движения.ВНаличииОборот
		|		ИНАЧЕ - ВТ_Движения.ВНаличииОборот
		|	КОНЕЦ КАК КоличествоИзСерии,
		|	ВЫБОР
		|		КОГДА ВТ_Движения.ВНаличииОборот > 0
		|			ТОГДА ВТ_Движения.ВНаличииОборот
		|		ИНАЧЕ - ВТ_Движения.ВНаличииОборот
		|	КОНЕЦ КАК ОбщееКоличествоНоменклатуры,
		|	ВЫБОР
		|		КОГДА ВТ_Движения.ВНаличииОборот > 0
		|			ТОГДА ВТ_Движения.ВНаличииОборот
		|		ИНАЧЕ - ВТ_Движения.ВНаличииОборот
		|	КОНЕЦ КАК КоличествоИзТовары
		|ПОМЕСТИТЬ ВТ_Перемещение
		|ИЗ
		|	ВТ_Движения КАК ВТ_Движения
		|ГДЕ
		|	ВТ_Движения.Регистратор ССЫЛКА Документ.ПеремещениеТоваров И НЕ 
		|	(ВТ_Движения.Регистратор.СкладПолучатель.ТипСклада = Значение(Перечисление.ТипыСкладов.РозничныйМагазин) ИЛИ 
		|	ВТ_Движения.Регистратор.СкладОтправитель.ТипСклада = Значение(Перечисление.ТипыСкладов.РозничныйМагазин))
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_Движения.Регистратор.СкладПолучатель.ТипСклада = Значение(Перечисление.ТипыСкладов.РозничныйМагазин)
		|			ТОГДА ""Despatch""
		|		ИНАЧЕ ""CustReturn""
		|	КОНЕЦ КАК НазваниеДокумента,
		|	ВТ_Движения.Период КАК Период,
		|	ВТ_Движения.Регистратор.Номер КАК РегистраторНомер,
		|	ВТ_Движения.Регистратор КАК Регистратор,
		|	ВТ_НомераПеремещениеТоваров.Значение КАК ЗаказКлиентаНомерПоДаннымКлиента,
		|	ВТ_ДатыПеремещениеТоваров.Значение КАК ЗаказКлиентаДатаПоДаннымКлиента,
		|	ВТ_Движения.НомерСтроки КАК НомерСтроки,
		|	ВТ_Движения.НомерСтроки КАК НомерСтрокиЦена,
		|	ВТ_Движения.Номенклатура КАК Номенклатура,
		|	ВТ_Движения.Регистратор.СкладОтправитель КАК Склад,
		|	ВТ_Движения.Серия КАК Серия,
		|	ВТ_Движения.ВНаличииОборот КАК КоличествоИзСерии,
		|	ВТ_Движения.ВНаличииОборот КАК ОбщееКоличествоНоменклатуры,
		|	ВТ_Движения.ВНаличииОборот КАК КоличествоИзТовары,
		|	ЕСТЬNULL(ВТ_Цены.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ВТ_Цены.Цена, 0) * ВТ_Движения.ВНаличииОборот КАК Сумма,
		|	ВТ_СКЛАДЫ.Партнер,
		|	ВТ_СКЛАДЫ.Контрагент,
		|	ВТ_КаналыПродаж.Значение КАК КаналПродаж,
		|	ВТ_РегионыПродаж.Значение КАК РегионПродаж
		|ПОМЕСТИТЬ ВТ_ПродажиВозвратыРозничныйМагазин
		|ИЗ
		|	ВТ_Движения КАК ВТ_Движения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СКЛАДЫ КАК ВТ_СКЛАДЫ
		|		ПО ВТ_Движения.Регистратор.СкладПолучатель = ВТ_СКЛАДЫ.Склад
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КаналыПродаж КАК ВТ_КаналыПродаж
		|		ПО ВТ_СКЛАДЫ.Партнер = ВТ_КаналыПродаж.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегионыПродаж КАК ВТ_РегионыПродаж
		|		ПО ВТ_СКЛАДЫ.Партнер = ВТ_РегионыПродаж.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
		|		ПО ВТ_Движения.Регистратор.СкладПолучатель.РозничныйВидЦены = ВТ_Цены.Цена
		|		И ВТ_Движения.Номенклатура = ВТ_Цены.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НомераПеремещениеТоваров КАК ВТ_НомераПеремещениеТоваров
		|		ПО ВТ_Движения.Регистратор = ВТ_НомераПеремещениеТоваров.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыПеремещениеТоваров КАК ВТ_ДатыПеремещениеТоваров
		|		ПО ВТ_Движения.Регистратор = ВТ_ДатыПеремещениеТоваров.Объект
		|ГДЕ
		|	ВТ_Движения.Регистратор ССЫЛКА Документ.ПеремещениеТоваров И ВТ_Движения.ВНаличииОборот > 0 И 
		|	(ВТ_Движения.Регистратор.СкладПолучатель.ТипСклада = Значение(Перечисление.ТипыСкладов.РозничныйМагазин) ИЛИ 
		|	ВТ_Движения.Регистратор.СкладОтправитель.ТипСклада = Значение(Перечисление.ТипыСкладов.РозничныйМагазин))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Движения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Реализации.НазваниеДокумента КАК НазваниеДокумента,
		|	ВТ_Реализации.Период КАК Период,
		|	ВТ_Реализации.РегистраторНомер КАК РегистраторНомер,
		|	ВТ_Реализации.Регистратор КАК Регистратор,	
		|	ВТ_Реализации.ЗаказКлиентаНомерПоДаннымКлиента КАК ЗаказКлиентаНомерПоДаннымКлиента,
		|	ВТ_Реализации.ЗаказКлиентаДатаПоДаннымКлиента КАК ЗаказКлиентаДатаПоДаннымКлиента,
		|	ВТ_Реализации.НомерСтроки КАК НомерСтроки,
		|	ВТ_Реализации.НомерСтрокиЦена КАК НомерСтрокиЦена,
		|	ВТ_Реализации.Номенклатура КАК Номенклатура,
		|	ВТ_Реализации.Склад КАК Склад,
		|	ВТ_Реализации.Серия КАК Серия,
		|	ВТ_Реализации.КоличествоИзСерии КАК КоличествоИзСерии,
		|	ВТ_Реализации.ОбщееКоличествоНоменклатуры КАК ОбщееКоличествоНоменклатуры,
		|	ВТ_Реализации.КоличествоИзТовары КАК КоличествоИзТовары,
		|	ВТ_Реализации.Цена КАК Цена,
		|	ВТ_Реализации.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ВТ_Реализации.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	ВТ_Реализации.СкидкаНаценка КАК СкидкаНаценка,
		|	ВТ_Реализации.КодАкции КАК КодАкции,
		|	ВТ_Реализации.Контрагент КАК Контрагент,
		|	ВТ_Реализации.Партнер КАК Партнер,
		|	ВТ_Реализации.КаналПродаж КАК КаналПродаж,
		|	ВТ_Реализации.РегионПродаж КАК РегионПродаж,
		|	ВТ_Реализации.SrcCRMDbId КАК SrcCRMDbId, 
		|	NULL КАК Сумма
		|ПОМЕСТИТЬ ВТ_ЕдиныйСписокДвижений
		|ИЗ
		|	ВТ_Реализации КАК ВТ_Реализации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ПриобретенияТоваровУслуг.НазваниеДокумента,
		|	ВТ_ПриобретенияТоваровУслуг.Период,
		|	ВТ_ПриобретенияТоваровУслуг.РегистраторНомер,
		|	ВТ_ПриобретенияТоваровУслуг.Регистратор,
		|	ВТ_ПриобретенияТоваровУслуг.НомерВходящегоДокумента,
		|	ВТ_ПриобретенияТоваровУслуг.ДатаВходящегоДокумента,
		|	ВТ_ПриобретенияТоваровУслуг.НомерСтроки,
		|	ВТ_ПриобретенияТоваровУслуг.НомерСтрокиЦена,
		|	ВТ_ПриобретенияТоваровУслуг.Номенклатура,
		|	ВТ_ПриобретенияТоваровУслуг.Склад,
		|	ВТ_ПриобретенияТоваровУслуг.Серия,
		|	ВТ_ПриобретенияТоваровУслуг.КоличествоИзСерии,
		|	ВТ_ПриобретенияТоваровУслуг.ОбщееКоличествоНоменклатуры,
		|	ВТ_ПриобретенияТоваровУслуг.КоличествоИзТовары,
		|	ВТ_ПриобретенияТоваровУслуг.Цена,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ_ПриобретенияТоваровУслуг.Контрагент,
		|	ВТ_ПриобретенияТоваровУслуг.Партнер,
		|	NULL,
		|	NULL,
		|	ВТ_ПриобретенияТоваровУслуг.SrcCRMDbId,
		|	NULL
		|ИЗ
		|	ВТ_ПриобретенияТоваровУслуг КАК ВТ_ПриобретенияТоваровУслуг
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ВозвратТоваровОтКлиента.НазваниеДокумента,
		|	ВТ_ВозвратТоваровОтКлиента.Период,
		|	ВТ_ВозвратТоваровОтКлиента.РегистраторНомер,
		|	ВТ_ВозвратТоваровОтКлиента.Регистратор,
		|	ВТ_ВозвратТоваровОтКлиента.НомерВходящегоДокумента,
		|	ВТ_ВозвратТоваровОтКлиента.ДатаВходящегоДокумента,
		|	ВТ_ВозвратТоваровОтКлиента.НомерСтроки,
		|	ВТ_ВозвратТоваровОтКлиента.НомерСтрокиЦена,
		|	ВТ_ВозвратТоваровОтКлиента.Номенклатура,
		|	ВТ_ВозвратТоваровОтКлиента.Склад,
		|	ВТ_ВозвратТоваровОтКлиента.Серия,
		|	ВТ_ВозвратТоваровОтКлиента.КоличествоИзСерии,
		|	ВТ_ВозвратТоваровОтКлиента.ОбщееКоличествоНоменклатуры,
		|	ВТ_ВозвратТоваровОтКлиента.КоличествоИзТовары,
		|	ВТ_ВозвратТоваровОтКлиента.Цена,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ_ВозвратТоваровОтКлиента.Контрагент,
		|	ВТ_ВозвратТоваровОтКлиента.Партнер,
		|	ВТ_ВозвратТоваровОтКлиента.КаналПродаж,
		|	ВТ_ВозвратТоваровОтКлиента.РегионПродаж,
		|	ВТ_ВозвратТоваровОтКлиента.SrcCRMDbId,
		|	ВТ_ВозвратТоваровОтКлиента.Сумма
		|ИЗ
		|	ВТ_ВозвратТоваровОтКлиента КАК ВТ_ВозвратТоваровОтКлиента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ВозвратТоваровПоставщику.НазваниеДокумента,
		|	ВТ_ВозвратТоваровПоставщику.Период,
		|	ВТ_ВозвратТоваровПоставщику.РегистраторНомер,
		|	ВТ_ВозвратТоваровПоставщику.Регистратор,
		|	NULL,
		|	NULL,
		|	ВТ_ВозвратТоваровПоставщику.НомерСтроки,
		|	ВТ_ВозвратТоваровПоставщику.НомерСтрокиЦена,
		|	ВТ_ВозвратТоваровПоставщику.Номенклатура,
		|	ВТ_ВозвратТоваровПоставщику.Склад,
		|	ВТ_ВозвратТоваровПоставщику.Серия,
		|	ВТ_ВозвратТоваровПоставщику.КоличествоИзСерии,
		|	ВТ_ВозвратТоваровПоставщику.ОбщееКоличествоНоменклатуры,
		|	ВТ_ВозвратТоваровПоставщику.КоличествоИзТовары,
		|	ВТ_ВозвратТоваровПоставщику.Цена,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ_ВозвратТоваровПоставщику.Контрагент,
		|	ВТ_ВозвратТоваровПоставщику.Партнер,
		|	NULL,
		|	NULL,
		|	ВТ_ВозвратТоваровПоставщику.SrcCRMDbId,
		|	ВТ_ВозвратТоваровПоставщику.Сумма
		|ИЗ
		|	ВТ_ВозвратТоваровПоставщику КАК ВТ_ВозвратТоваровПоставщику
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Пересорт.НазваниеДокумента,
		|	ВТ_Пересорт.Период,
		|	ВТ_Пересорт.РегистраторНомер,
		|	ВТ_Пересорт.Регистратор,
		|	NULL,
		|	NULL,
		|	ВТ_Пересорт.НомерСтроки,
		|	ВТ_Пересорт.НомерСтрокиЦена,
		|	ВТ_Пересорт.Номенклатура,
		|	ВТ_Пересорт.Склад,
		|	ВТ_Пересорт.Серия,
		|	ВТ_Пересорт.КоличествоИзСерии,
		|	ВТ_Пересорт.ОбщееКоличествоНоменклатуры,
		|	ВТ_Пересорт.КоличествоИзТовары,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	ВТ_Пересорт КАК ВТ_Пересорт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Перемещение.НазваниеДокумента,
		|	ВТ_Перемещение.Период,
		|	ВТ_Перемещение.РегистраторНомер,
		|	ВТ_Перемещение.Регистратор,
		|	NULL,
		|	NULL,
		|	ВТ_Перемещение.НомерСтроки,
		|	ВТ_Перемещение.НомерСтрокиЦена,
		|	ВТ_Перемещение.Номенклатура,
		|	ВТ_Перемещение.Склад,
		|	ВТ_Перемещение.Серия,
		|	ВТ_Перемещение.КоличествоИзСерии,
		|	ВТ_Перемещение.ОбщееКоличествоНоменклатуры,
		|	ВТ_Перемещение.КоличествоИзТовары,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	ВТ_Перемещение КАК ВТ_Перемещение
		
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ПродажиВозвратыРозничныйМагазин.НазваниеДокумента,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.Период,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.РегистраторНомер,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.Регистратор,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.ЗаказКлиентаНомерПоДаннымКлиента,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.ЗаказКлиентаДатаПоДаннымКлиента,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.НомерСтроки,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.НомерСтрокиЦена,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.Номенклатура,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.Склад,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.Серия,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.КоличествоИзСерии,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.ОбщееКоличествоНоменклатуры,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.КоличествоИзТовары,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.Цена,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.Контрагент,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.Партнер,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.КаналПродаж,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.РегионПродаж,
		|	NULL,
		|	ВТ_ПродажиВозвратыРозничныйМагазин.Сумма
		|ИЗ
		|	ВТ_ПродажиВозвратыРозничныйМагазин КАК ВТ_ПродажиВозвратыРозничныйМагазин
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЕдиныйСписокДвижений.НазваниеДокумента КАК НазваниеДокумента,
		|	ВТ_ЕдиныйСписокДвижений.Период КАК Период,
		|	ВТ_ЕдиныйСписокДвижений.РегистраторНомер КАК РегистраторНомер,
		|	ВТ_ЕдиныйСписокДвижений.Регистратор КАК Регистратор,
		
		//*-Начинаются истории это показываем, это не показываем...вот пришло время скрыть контрагента - партнера 
		// с которого пришел сторонний приход 
		|	ВЫБОР 
		|		КОГДА ВТ_ЕдиныйСписокДвижений.НазваниеДокумента <> ""VendReceiptEx"" Тогда
		|			ВТ_ЕдиныйСписокДвижений.Партнер.Код 
		|		ИНАЧЕ ""000010101"" 
		|	КОНЕЦ КАК ПартнерКод,
		|	ВЫБОР 
		|		КОГДА ВТ_ЕдиныйСписокДвижений.Контрагент.ИНН <> """" И ВТ_ЕдиныйСписокДвижений.НазваниеДокумента <> ""VendReceiptEx"" Тогда
		|			ВТ_ЕдиныйСписокДвижений.Контрагент.ИНН 
		|		ИНАЧЕ ""000010101"" 
		|	КОНЕЦ КАК КонтрагентИНН,
		
		//*-
		|	ВТ_ЕдиныйСписокДвижений.ЗаказКлиентаНомерПоДаннымКлиента КАК ЗаказКлиентаНомерПоДаннымКлиента,
		|	ВТ_ЕдиныйСписокДвижений.ЗаказКлиентаДатаПоДаннымКлиента КАК ЗаказКлиентаДатаПоДаннымКлиента,
		|	ВТ_ЕдиныйСписокДвижений.НомерСтроки КАК НомерСтроки,
		|	ВТ_ЕдиныйСписокДвижений.НомерСтрокиЦена КАК НомерСтрокиЦена,
		|	ВТ_ЕдиныйСписокДвижений.Номенклатура КАК Номенклатура,
		|	ВТ_ЕдиныйСписокДвижений.Склад КАК Склад,
		|	ВТ_ЕдиныйСписокДвижений.Серия КАК Серия,
		|	ВТ_ЕдиныйСписокДвижений.КоличествоИзСерии КАК КоличествоИзСерии,
		|	ВТ_ЕдиныйСписокДвижений.ОбщееКоличествоНоменклатуры КАК ОбщееКоличествоНоменклатуры,
		|	ВТ_ЕдиныйСписокДвижений.КоличествоИзТовары КАК КоличествоИзТовары,
		|	ВТ_ЕдиныйСписокДвижений.Цена КАК Цена,
		|	ВТ_ЕдиныйСписокДвижений.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ВТ_ЕдиныйСписокДвижений.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	ВТ_ЕдиныйСписокДвижений.СкидкаНаценка КАК СкидкаНаценка,
		|	ВТ_ЕдиныйСписокДвижений.КодАкции КАК КодАкции,
		//*-
		|	ВЫБОР 
		|		КОГДА ВТ_ЕдиныйСписокДвижений.НазваниеДокумента <> ""VendReceiptEx"" Тогда
		|			ВТ_ЕдиныйСписокДвижений.Партнер 
		|		ИНАЧЕ ""ООО РиК"" 
		|	КОНЕЦ КАК Партнер,
		|	ВЫБОР 
		|		КОГДА ВТ_ЕдиныйСписокДвижений.НазваниеДокумента <> ""VendReceiptEx"" Тогда
		|			ВТ_ЕдиныйСписокДвижений.Контрагент 
		|		ИНАЧЕ ""ООО РиК"" 
		|	КОНЕЦ КАК Контрагент,
		//|	ВТ_ЕдиныйСписокДвижений.Контрагент КАК Контрагент,
		//|	ВТ_ЕдиныйСписокДвижений.Партнер КАК Партнер,
		|	ВТ_ЕдиныйСписокДвижений.КаналПродаж КАК КаналПродаж,
		|	ВТ_ЕдиныйСписокДвижений.РегионПродаж КАК РегионПродаж,
		|	ВТ_ЕдиныйСписокДвижений.Сумма КАК Сумма,
		|	ВТ_ЕдиныйСписокДвижений.SrcCRMDbId КАК SrcCRMDbId,
		|	ВТ_Сопоставления.УпаковкаМонолит КАК УпаковкаМонолит,
		|	ВТ_Сопоставления.НоменклатураМонолит КАК НоменклатураМонолит,
		|	ВТ_Сопоставления.Коэффициент КАК Коэффициент,
		|	ВТ_Склады.ШлюзОрганизации КАК ШлюзОрганизации,
		|	ВТ_Склады.Пароль КАК Пароль,
		|	ВТ_Склады.Шлюз КАК Шлюз,
		|	ВТ_Склады.КодСклада КАК КодСклада,
		|	ВТ_Склады.ФлагУдаления КАК ФлагУдаления
		|ИЗ
		|	ВТ_ЕдиныйСписокДвижений КАК ВТ_ЕдиныйСписокДвижений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК ВТ_Склады
		|		ПО (ВТ_ЕдиныйСписокДвижений.Склад = ВТ_Склады.Склад)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сопоставления КАК ВТ_Сопоставления
		|		ПО (ВТ_ЕдиныйСписокДвижений.Номенклатура = ВТ_Сопоставления.Номенклатура)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор,
		|	Номенклатура,
		|	Серия,
		|	НомерСтроки,
		|	НомерСтрокиЦена
		|ИТОГИ
		|	МАКСИМУМ(Пароль),
		|	МАКСИМУМ(Шлюз),
		|	МАКСИМУМ(ФлагУдаления)
		|ПО
		|	ШлюзОрганизации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ЕдиныйСписокДвижений.Период КАК Период,
		|	ВТ_ЕдиныйСписокДвижений.РегистраторНомер КАК РегистраторНомер,
		|	ВТ_ЕдиныйСписокДвижений.НазваниеДокумента КАК НазваниеДокумента,
		|	ВТ_Сопоставления.НоменклатураМонолит КАК НоменклатураМонолит,
		|	ВТ_Сопоставления.УпаковкаМонолит КАК УпаковкаМонолит,
		|	ВТ_Сопоставления.Коэффициент КАК Коэффициент,
		|	ВТ_ЕдиныйСписокДвижений.НомерСтроки КАК НомерСтроки,
		|	ВТ_ЕдиныйСписокДвижений.Серия КАК Серия, 
		|	ВТ_ЕдиныйСписокДвижений.Серия.ГоденДо КАК СерияГоденДо,
		|	ВТ_ЕдиныйСписокДвижений.Серия.ДатаПроизводства КАК СерияДатаПроизводства,
		|	ВТ_ЕдиныйСписокДвижений.КоличествоИзСерии КАК КоличествоИзСерии,
		|	ВТ_Склады.ШлюзОрганизации КАК ШлюзОрганизации
		|ИЗ
		|	ВТ_ЕдиныйСписокДвижений КАК ВТ_ЕдиныйСписокДвижений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сопоставления КАК ВТ_Сопоставления
		|		ПО ВТ_ЕдиныйСписокДвижений.Номенклатура = ВТ_Сопоставления.Номенклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК ВТ_Склады
		|		ПО ВТ_ЕдиныйСписокДвижений.Склад = ВТ_Склады.Склад
		|	УПОРЯДОЧИТЬ ПО
		|		НазваниеДокумента,
		|		РегистраторНомер,
		|		НоменклатураМонолит,
		|		СерияГоденДо,
		|		СерияДатаПроизводства	
		|ИТОГИ ПО
		|	ШлюзОрганизации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР 
		|		КОГДА ВТ_ЕдиныйСписокДвижений.НазваниеДокумента <> ""VendReceiptEx"" Тогда
		|			ВТ_ЕдиныйСписокДвижений.Партнер 
		|		ИНАЧЕ ""ООО РиК"" 
		|	КОНЕЦ КАК Партнер,
		|	МАКСИМУМ(ВЫБОР 
		|		КОГДА ВТ_ЕдиныйСписокДвижений.НазваниеДокумента <> ""VendReceiptEx"" Тогда
		|			ВТ_ЕдиныйСписокДвижений.Контрагент 
		|		ИНАЧЕ ""ООО РиК"" 
		|	КОНЕЦ) КАК Контрагент,
		
		
		//|	максимум(ВТ_ЕдиныйСписокДвижений.Регистратор.Контрагент) КАК Контрагент,
		//|	ВТ_ЕдиныйСписокДвижений.Партнер КАК Партнер,
		|	ЕСТЬNULL(ВТ_СоответствияТорговыхТочек.КодТорговойТочки, """") КАК КодТорговойТочки,
		//*-Начинаются истории это показываем, это не показываем...вот пришло время скрыть контрагента - партнера 
		// с которого пришел сторонний приход 
		|	ВЫБОР 
		|		КОГДА ВТ_ЕдиныйСписокДвижений.НазваниеДокумента <> ""VendReceiptEx"" Тогда
		|			ВТ_ЕдиныйСписокДвижений.Партнер.Код 
		|		ИНАЧЕ ""000010101"" 
		|	КОНЕЦ КАК ПартнерКод,
		|	ВЫБОР 
		|		КОГДА ВТ_ЕдиныйСписокДвижений.Контрагент.ИНН <> """" И ВТ_ЕдиныйСписокДвижений.НазваниеДокумента <> ""VendReceiptEx"" Тогда
		|			ВТ_ЕдиныйСписокДвижений.Контрагент.ИНН 
		|		ИНАЧЕ ""000010101"" 
		|	КОНЕЦ КАК КонтрагентИНН,
		//*-		
		//|	ВТ_ЕдиныйСписокДвижений.Партнер.Код КАК ПартнерКод,
		//|	ВЫБОР КОГДА ВТ_ЕдиныйСписокДвижений.Контрагент.ИНН <> """" Тогда
		//|		ВТ_ЕдиныйСписокДвижений.Контрагент.ИНН ИНАЧЕ
		//|		""000010101"" КОНЕЦ КАК КонтрагентИНН,
		|	максимум( ВТ_ЕдиныйСписокДвижений.Регистратор.АдресДоставки) КАК АдресДоставки,
		|	ВТ_Склады.ШлюзОрганизации КАК ШлюзОрганизации
		|ИЗ
		|	ВТ_ЕдиныйСписокДвижений КАК ВТ_ЕдиныйСписокДвижений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоответствияТорговыхТочек КАК ВТ_СоответствияТорговыхТочек
		|		ПО ВТ_ЕдиныйСписокДвижений.Партнер = ВТ_СоответствияТорговыхТочек.Партнер
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Склады КАК ВТ_Склады
		|		ПО (ВТ_Склады.Склад = ВТ_ЕдиныйСписокДвижений.Склад)
		|ГДЕ
		|	НЕ ВТ_ЕдиныйСписокДвижений.Контрагент ЕСТЬ NULL
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР 
		|		КОГДА ВТ_ЕдиныйСписокДвижений.НазваниеДокумента <> ""VendReceiptEx"" Тогда
		|			ВТ_ЕдиныйСписокДвижений.Партнер 
		|		ИНАЧЕ ""ООО РиК"" 
		|	КОНЕЦ,
		|	ЕСТЬNULL(ВТ_СоответствияТорговыхТочек.КодТорговойТочки, """"),
		|	ВЫБОР 
		|		КОГДА ВТ_ЕдиныйСписокДвижений.НазваниеДокумента <> ""VendReceiptEx"" Тогда
		|			ВТ_ЕдиныйСписокДвижений.Партнер.Код 
		|		ИНАЧЕ ""000010101"" 
		|	КОНЕЦ,
		|	ВЫБОР 
		|		КОГДА ВТ_ЕдиныйСписокДвижений.Контрагент.ИНН <> """" И ВТ_ЕдиныйСписокДвижений.НазваниеДокумента <> ""VendReceiptEx"" Тогда
		|			ВТ_ЕдиныйСписокДвижений.Контрагент.ИНН 
		|		ИНАЧЕ ""000010101"" 
		|	КОНЕЦ,
		|	ВТ_Склады.ШлюзОрганизации
		|ИТОГИ ПО
		|	ШлюзОрганизации
		|";
	
КонецФункции

Функция ВернутьДатуСтрокойВФорматеXML(ДатаДляПреобразования) Экспорт
	
	Возврат	Формат(ДатаДляПреобразования, "ДФ = 'yyyy-MM-ddTЧЧ:мм:сс'");
	
КонецФункции

Процедура ИнициализацияРасширенияДляТипаМонолита(ТипМонолита) Экспорт
	
	УстановитьДополнительноеСведение( Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Общие, "КодШлюза" + ТипМонолита + "Партнеры", УстановитьТипДанных( Тип("Строка"), 36 ) );  
  	УстановитьДополнительноеСведение( Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Поставщики, "СтороннийДистрибьютор" + ТипМонолита + "Партнеры", УстановитьТипДанных( Тип("Булево") ) );  
  	УстановитьДополнительноеСведение( Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Поставщики, "ОсновнойПоставщик" + ТипМонолита + "Партнеры", УстановитьТипДанных( Тип("Булево") ) );  
	
	//Массив = Новый Массив;
	//
	//Массив.Добавить("Традиционная розница");
	//Массив.Добавить("RKA");	
	//Массив.Добавить("On-Trade");
	//Массив.Добавить("Опт");
	//Массив.Добавить("Субдистрибьютор");
	//Массив.Добавить("Смешанный");

	//УстановитьДополнительноеСведение( Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Клиенты, "Канал продажи_" + ТипМонолита, УстановитьТипДанных( Тип("СправочникСсылка.ЗначенияСвойствОбъектов") ) , Массив);  
	//
	//Массив = Новый Массив; 
	//
	//Массив.Добавить("Город");
	//Массив.Добавить("Область");
	//
	//УстановитьДополнительноеСведение( Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Клиенты, "Регион продажи_" + ТипМонолита, УстановитьТипДанных( Тип("СправочникСсылка.ЗначенияСвойствОбъектов") ) , Массив);
	
КонецПроцедуры

Функция УстановитьДополнительноеСведение( НаборСвойств, ИмяРеквизита, ТипЗначения = Неопределено, Массив  = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|  ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	|ИЗ
	|  ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|  ДополнительныеРеквизитыИСведения.Заголовок = &Заголовок
	|  И ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств";
	
	Запрос.УстановитьПараметр( "Заголовок", ИмяРеквизита );
	Запрос.УстановитьПараметр( "НаборСвойств", НаборСвойств );
	
	Выборка = Запрос.Выполнить().Выбрать();
	Элемент = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка();
	Пока Выборка.Следующий() Цикл 
		Элемент = Выборка.Ссылка;
	КонецЦикла;
	
	
	Если Элемент.Пустая() Тогда
		
		НовыйЭлемент = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		НовыйЭлемент.Заголовок = ИмяРеквизита;
		НовыйЭлемент.НаборСвойств = НаборСвойств; 
		НовыйЭлемент.Наименование = НовыйЭлемент.Заголовок + " (" + НовыйЭлемент.НаборСвойств + ")";
		НовыйЭлемент.ТипЗначения = ТипЗначения;
		НовыйЭлемент.Доступен = Истина;
		НовыйЭлемент.Виден = Истина;
		НовыйЭлемент.ЭтоДополнительноеСведение = Истина;
		
		НовыйЭлемент.ДополнительныеЗначенияИспользуются = НЕ Массив = Неопределено;
		
		ЗаголовокОбъекта = ИмяРеквизита;
		ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ЗаголовокОбъекта, "");
		ЗаголовокОбъектаЧастями = СтрРазделить(ЗаголовокОбъекта, " ", Ложь);
		Для Каждого ЧастьЗаголовка Из ЗаголовокОбъектаЧастями Цикл
			НовыйЭлемент.Имя = НовыйЭлемент.Имя + ВРег(Лев(ЧастьЗаголовка, 1)) + Сред(ЧастьЗаголовка, 2);
		КонецЦикла;
		
		УИД = Новый УникальныйИдентификатор();
		НовыйЭлемент.Имя = НовыйЭлемент.Имя;
		
		НовыйЭлемент.ОбменДанными.Загрузка = Истина;
		НовыйЭлемент.Записать();
		
		Элемент = НовыйЭлемент.Ссылка;
	КонецЕсли;
	
	НаборСвойствОбъект = НаборСвойств.ПолучитьОбъект();
	Если НаборСвойствОбъект.ДополнительныеРеквизиты.Найти( Элемент, "Свойство" ) = Неопределено Тогда   
		НовыйНаборСвойств = НаборСвойствОбъект.ДополнительныеСведения.Добавить();
		НовыйНаборСвойств.Свойство = Элемент;
	КонецЕсли;
	Если НаборСвойствОбъект.Модифицированность() Тогда
		НаборСвойствОбъект.Записать();
	КонецЕсли;

	Если НЕ Массив = Неопределено Тогда
		ЗаполнитьСправочникЗначенияСвойствОбъектовПоСтруктуре(Элемент, Массив);
	КонецЕсли;
 
КонецФункции

Процедура ЗаполнитьСправочникЗначенияСвойствОбъектовПоСтруктуре(Владелец, Массив)

	Номер = 1;
	Для Каждого Элемент из Массив Цикл
		
		ЗначенияСвойствОбъектов = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Элемент, , , Владелец);			
		
		Если ЗначениеЗаполнено(ЗначенияСвойствОбъектов) Тогда 
			Продолжить;
		КонецЕсли;
		
		ОБъектЗначенияСвойствОбъектов = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
		
		ОБъектЗначенияСвойствОбъектов.ПолноеНаименование = Строка(Номер);
		ОБъектЗначенияСвойствОбъектов.Наименование = Элемент;
		
		ОБъектЗначенияСвойствОбъектов.Владелец = Владелец;
		ОБъектЗначенияСвойствОбъектов.Записать();
		
		Номер = Номер + 1;
		
	КонецЦикла
	
КонецПроцедуры

Функция ЗаполнитьСтруктуруСтрокиДляЗаписи() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПартнерКод", 						"");
	Результат.Вставить("КонтрагентИНН", 					"");
	Результат.Вставить("РегионПродаж", 						"");
	Результат.Вставить("КаналПродаж", 						"");
	Результат.Вставить("ЗаказКлиентаНомерПоДаннымКлиента", 	"");
	Результат.Вставить("ЗаказКлиентаДатаПоДаннымКлиента", 	"");	
	Результат.Вставить("НазваниеДокумента", 				"");
	Результат.Вставить("РегистраторНомер", 					"");
	Результат.Вставить("Период", 							"");	
	Результат.Вставить("SrcCRMDbId", 						"");
	Результат.Вставить("PayDate", 							"");
	Результат.Вставить("RejectReasonCode", 					"");	
	Результат.Вставить("КодСклада", 						""); 
	Результат.Вставить("НоменклатураМонолит", 				"");
	Результат.Вставить("Цена", 								"");
	Результат.Вставить("Количество", 						"");
	Результат.Вставить("УпаковкаМонолит",					"ea");
	Результат.Вставить("Коэффициент",						1);
	Результат.Вставить("КодАкции", 							"");
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСтруктуруДляДвижений() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ШлюзОрганизации",			Неопределено);
	Результат.Вставить("Шлюз",						Неопределено);
	Результат.Вставить("Пароль",					Неопределено);
	Результат.Вставить("ДатаОтчета",				Неопределено);
	Результат.Вставить("ДатаОтчетаСтрокой",			Неопределено);
	Результат.Вставить("ФлагУдаления",				Неопределено);
	Результат.Вставить("ВидОбмена",					Перечисления.Mon_ВидыОбменов.CRMDespatchEx);
	Результат.Вставить("ВыборкаПоШлюзамДокументам",	Неопределено);
	Результат.Вставить("ВыборкаПоШлюзамПартиям",	Неопределено);
	Результат.Вставить("ВыборкаПоШлюзамПартнерам",	Неопределено);
	
	
	Возврат Результат;
	
КонецФункции

Функция НайтиИндексСтруктурыИзМассива(МассивСтруктурШлюзовДляПромежуточногоСбораПоШлюзам, ШлюзОрганизации) Экспорт
	
	Результат = 0;
	
	Для Каждого СтруктураШлюза Из МассивСтруктурШлюзовДляПромежуточногоСбораПоШлюзам Цикл
		
		Если СтруктураШлюза.ШлюзОрганизации = ШлюзОрганизации Тогда Прервать; КонецЕсли;
				
		Результат = Результат + 1;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//Копия Функции определяет банковский счет выбранной организации.
//
// Возвращает банковский счет организации, если найден один банковский счет.
// Возвращает Неопределено, если банковский счет не найден или счетов больше одного.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - Ссылка на организацию
//	Валюта - СправочникСсылка.Валюты - Валюта банковского счета.
//
// Возвращаемое значение:
//	СправочникСсылка.БанковскиеСчетаОрганизаций - Найденный банковский счет организации.
//
Функция ПолучитьБанковскийСчетОрганизацииПоУмолчаниюКастомная(Организация, Валюта = Неопределено, НаправлениеДеятельности = Неопределено) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 2
	|	БанковскиеСчетаОрганизаций.Ссылка КАК БанковскийСчетОрганизации
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ПО ДополнительныеСведения.Объект ССЫЛКА Справочник.БанковскиеСчетаОрганизаций
	|	И ДополнительныеСведения.Свойство.Имя = ""ОсновнойРасчетныйСчетОрганизацииБанковскиеСчета""
	|  И ДополнительныеСведения.Объект = БанковскиеСчетаОрганизаций.Ссылка
	|ГДЕ
	|	НЕ БанковскиеСчетаОрганизаций.ПометкаУдаления
	|	И НЕ БанковскиеСчетаОрганизаций.Закрыт
	|	И (БанковскиеСчетаОрганизаций.Владелец = &Организация
	|		ИЛИ &Организация = Неопределено)
	|	И (БанковскиеСчетаОрганизаций.ВалютаДенежныхСредств = &Валюта
	|		ИЛИ &Валюта = Неопределено)
	|	И (БанковскиеСчетаОрганизаций.НаправлениеДеятельности = &НаправлениеДеятельности
	|			ИЛИ &НаправлениеДеятельности = НЕОПРЕДЕЛЕНО)
	|	И ДополнительныеСведения.Значение = Истина
	|;
	|
	|ВЫБРАТЬ ПЕРВЫЕ 2
	|	БанковскиеСчетаОрганизаций.Ссылка КАК БанковскийСчетОрганизации
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|ГДЕ
	|	НЕ БанковскиеСчетаОрганизаций.ПометкаУдаления
	|	И НЕ БанковскиеСчетаОрганизаций.Закрыт
	|	И (БанковскиеСчетаОрганизаций.Владелец = &Организация
	|		ИЛИ &Организация = Неопределено)
	|	И (БанковскиеСчетаОрганизаций.ВалютаДенежныхСредств = &Валюта
	|		ИЛИ &Валюта = Неопределено)
	|	И (БанковскиеСчетаОрганизаций.НаправлениеДеятельности = &НаправлениеДеятельности
	|			ИЛИ &НаправлениеДеятельности = НЕОПРЕДЕЛЕНО)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 2
	|	БанковскиеСчетаОрганизаций.Ссылка КАК БанковскийСчетОрганизации
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|ГДЕ
	|	НЕ БанковскиеСчетаОрганизаций.ПометкаУдаления
	|	И НЕ БанковскиеСчетаОрганизаций.Закрыт
	|	И (БанковскиеСчетаОрганизаций.Владелец = &Организация
	|		ИЛИ &Организация = Неопределено)
	|	И (БанковскиеСчетаОрганизаций.ВалютаДенежныхСредств = &Валюта
	|		ИЛИ &Валюта = Неопределено)
	|");
	
	Запрос.УстановитьПараметр("Организация", ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));
	Запрос.УстановитьПараметр("Валюта", ?(ЗначениеЗаполнено(Валюта), Валюта, Неопределено));
	Запрос.УстановитьПараметр("НаправлениеДеятельности", ?(ЗначениеЗаполнено(НаправлениеДеятельности), НаправлениеДеятельности, Неопределено));
	
	Результат = Запрос.ВыполнитьПакет();
	ВыборкаПоОсновномуСчету = Результат[0].Выбрать();
	ВыборкаПоНаправлению  = Результат[1].Выбрать();
	ВыборкаБезНаправления = Результат[2].Выбрать();
	
	Если ВыборкаПоНаправлению.Количество() = 1 И ВыборкаПоНаправлению.Следующий() Тогда
		
		БанковскийСчетОрганизации = ВыборкаПоНаправлению.БанковскийСчетОрганизации;
		
	ИначеЕсли ВыборкаБезНаправления.Количество() = 1 И ВыборкаБезНаправления.Следующий() Тогда
		
		БанковскийСчетОрганизации = ВыборкаБезНаправления.БанковскийСчетОрганизации;
		
	ИначеЕсли ВыборкаПоОсновномуСчету.Количество() = 1 И ВыборкаПоОсновномуСчету.Следующий() Тогда
		
		БанковскийСчетОрганизации = ВыборкаПоОсновномуСчету.БанковскийСчетОрганизации;
		
	Иначе
		
		БанковскийСчетОрганизации = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат БанковскийСчетОрганизации;

КонецФункции