
&НаСервере
Функция ПоказатьВТабличномДокументеНаСервере()
	
	СписокДокументов = Неопределено;
	
	Mon_Парсер.МонолитПарсер(Объект.ТекстXML, СписокДокументов);
	
	ЭтотОбъектО 	= РеквизитФормыВЗначение("Объект");
	МакетПарсинга 	= ЭтотОбъектО.ПолучитьМакет("МакетПарсинга");
	ОбластьШапка 	= МакетПарсинга.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрока	= МакетПарсинга.ПолучитьОбласть("ОбластьСтрока");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
		
	
	Для каждого Документ Из СписокДокументов Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Документ);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	
	
	Возврат ТабличныйДокумент; 
	
КонецФункции


&НаКлиенте
Процедура ПоказатьВТабличномДокументе(Команда)
	ПоказатьВТабличномДокументеНаСервере();
	
	ДокументРезультат = ПоказатьВТабличномДокументеНаСервере();
	
	ДокументРезультат.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьТаройНаСервере()
	ОбъектЗаказ = Объект.Заказ.ПолучитьОбъект();
	Mon_ЧтениеРегистра.ЗаполнениеТарой(ОбъектЗаказ.Товары);
	ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьТарой(Команда)
	ДополнитьТаройНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверкаДвойниковНаСервере()
	
	ОбъектЗаказ = Объект.Заказ.ПолучитьОбъект();
	
	НачатьТранзакцию();
	
	ОбъектЗаказ.Записать();
	
	ФлагВБазеБольшеОдногоДокументаСРеквизитамиБалтики = Mon_ЧтениеРегистра.ПроверитьДокументыСРеквизитамиБалтики(Объект.Заказ);
	
	Если ФлагВБазеБольшеОдногоДокументаСРеквизитамиБалтики Тогда
			
			ОтменитьТранзакцию();
			//Продолжить;
			
		Иначе
			
			ЗафиксироватьТранзакцию();
			
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаДвойников(Команда)
	ПроверкаДвойниковНаСервере();
КонецПроцедуры

&НаСервере
Процедура кнопкаНаСервере()
	
	Запись 			= РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	Запись.Объект 	= перемещение;
	Запись.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "НомерЗаказаМонолитПеремещениеТоваров");
	Запись.Значение = "123";
	Запись.Записать(Истина);
	
	Запись 			= РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	Запись.Объект	= перемещение;
	Запись.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ДатаЗаказаМонолитПеремещениеТоваров");
	Запись.Значение = '20200101';
	Запись.Записать(Истина);

КонецПроцедуры

&НаКлиенте
Процедура кнопка(Команда)
	кнопкаНаСервере();
КонецПроцедуры


