
&НаСервереБезКонтекста
Процедура ОчиститьНаСервере(ПериодЧистки)
	НачатьТранзакцию();
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Mon_ВходящиеДанные.ШлюзОрганизации КАК ШлюзОрганизации,
	                      |	Mon_ВходящиеДанные.ВидОбмена КАК ВидОбмена,
	                      |	Mon_ВходящиеДанные.ДатаЗагрузки КАК ДатаЗагрузки,
	                      |	Mon_ВходящиеДанные.ТекстОбмена КАК ТекстОбмена,
	                      |	Mon_ВходящиеДанные.ДатаОбработки КАК ДатаОбработки,
	                      |	Mon_ВходящиеДанные.Статус КАК Статус
	                      |ИЗ
	                      |	РегистрСведений.Mon_ВходящиеДанные КАК Mon_ВходящиеДанные
	                      |ГДЕ
	                      |	Mon_ВходящиеДанные.ДатаЗагрузки < &ПериодНачала
	                      |	ИЛИ Mon_ВходящиеДанные.ДатаЗагрузки > &ПериодОкончания");
	Запрос.УстановитьПараметр("ПериодНачала",	ПериодЧистки.ДатаНачала);
	Запрос.УстановитьПараметр("ПериодОкончания",ПериодЧистки.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	НаборЗаписей = РегистрыСведений.Mon_ВходящиеДанные.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);

		
	КонецЦикла;
	НаборЗаписей.Записать();
	
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Mon_ИсходящиеДанные.ШлюзОрганизации КАК ШлюзОрганизации,
	                      |	Mon_ИсходящиеДанные.ВидОбмена КАК ВидОбмена,
	                      |	Mon_ИсходящиеДанные.ДатаОтчета КАК ДатаОтчета,
	                      |	Mon_ИсходящиеДанные.ДатаОбработки КАК ДатаОбработки,
	                      |	Mon_ИсходящиеДанные.ТекстОбмена КАК ТекстОбмена,
						  |	Mon_ИсходящиеДанные.Ответ КАК Ответ,
	                      |	Mon_ИсходящиеДанные.ДатаВыгрузки КАК ДатаВыгрузки,
	                      |	Mon_ИсходящиеДанные.Статус КАК Статус
	                      |ИЗ
	                      |	РегистрСведений.Mon_ИсходящиеДанные КАК Mon_ИсходящиеДанные
	                      |ГДЕ
	                      |	Mon_ИсходящиеДанные.ДатаОбработки < &ПериодНачала
	                      |	ИЛИ Mon_ИсходящиеДанные.ДатаОбработки > &ПериодОкончания");
	
	Запрос.УстановитьПараметр("ПериодНачала",	ПериодЧистки.ДатаНачала);
	Запрос.УстановитьПараметр("ПериодОкончания",ПериодЧистки.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	НаборЗаписей = РегистрыСведений.Mon_ИсходящиеДанные.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
	КонецЦикла;
	НаборЗаписей.Записать();
	//ОтменитьТранзакцию();
	ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере(ПериодЧистки);
КонецПроцедуры
